import 'package:project_azkar/data/dua_model.dart';

import '../utils/enums.dart';

class ZekrRepository {
  static final List<DuaModel> _allAzkar = [
    DuaModel(
      dua:
          "اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ",
      benefit:
          "من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح.",
      benefitSource:
          'حديث أُبي بن كعب رضي الله عنه، أخرجه الحاكم والطبراني، وصححه الألباني في (صحيح الترغيب والترهيب 662)',
      time: [DuaTime.day, DuaTime.night, DuaTime.afterPrayer],
      source: "آية الكرسى - البقرة ٢٥٥",
    ),
    DuaModel(
      count: 3,
      dua:
          "قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ",
      benefit: "تكفي المسلم من كل شيء (أي تقيه من كل شر وتغنيه عن غيرها).",
      benefitSource:
          'حديث عبد الله بن خبيب رضي الله عنه، قال رسول الله ﷺ: "قل هو الله أحد والمعوذتين حين تمسي وحين تصبح ثلاث مرات تكفيك من كل شيء". أخرجه أبو داود والترمذي والنسائي، وصححه الألباني في (صحيح أبي داود 5082).',
      time: [DuaTime.day, DuaTime.night],
      source: "الإخلاص",
    ),
    DuaModel(
      count: 3,
      dua:
          "قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّالنَّفَّاثَاتِ فِي الْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ",
      benefit: "تكفي المسلم من كل شيء (أي تقيه من كل شر وتغنيه عن غيرها).",
      benefitSource:
          'حديث عبد الله بن خبيب رضي الله عنه، قال رسول الله ﷺ: "قل هو الله أحد والمعوذتين حين تمسي وحين تصبح ثلاث مرات تكفيك من كل شيء". أخرجه أبو داود والترمذي والنسائي، وصححه الألباني في (صحيح أبي داود 5082).',
      time: [DuaTime.day, DuaTime.night],
      source: "الفلق",
    ),
    DuaModel(
      count: 3,
      dua:
          "قُلْ أَعُوذُ بِرَبِّ النَّاسِ، مَلِكِ النَّاسِ، إِلَهِ النَّاسِ، مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ، الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ، مِنَ الْجِنَّةِ وَ النَّاسِ",
      benefit: "تكفي المسلم من كل شيء (أي تقيه من كل شر وتغنيه عن غيرها).",
      benefitSource:
          'حديث عبد الله بن خبيب رضي الله عنه، قال رسول الله ﷺ: "قل هو الله أحد والمعوذتين حين تمسي وحين تصبح ثلاث مرات تكفيك من كل شيء". أخرجه أبو داود والترمذي والنسائي، وصححه الألباني في (صحيح أبي داود 5082).',
      time: [DuaTime.day, DuaTime.night],
      source: "الناس",
    ),

    DuaModel(
      dua:
          "أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُبِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر",
      time: [DuaTime.day],
      source: '',
      benefit: '',
    ),
    DuaModel(
      dua:
          "أَمْسَيْـنا وَأَمْسـى المـلكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذهِ اللَّـيْلَةِ وَخَـيرَ ما بَعْـدَهـا ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذهِ اللَّـيْلةِ وَشَرِّ ما بَعْـدَهـا ، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُبِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر",
      benefit: '',
      source: '',
      time: [DuaTime.night],
    ),
    DuaModel(
      dua:
          "آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ",
      benefit: '',
      source: '',
      time: [DuaTime.night],
    ),
    DuaModel(
      dua:
          "اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُ بِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ",
      benefit:
          'من قالها موقناً بها حين يصبح فمات من يومه قبل أن يمسي فهو من أهل الجنة.',
      benefitSource:
          'حديث شداد بن أوس رضي الله عنه، أخرجه الإمام البخاري في صحيحه (رقم 6306)',
      source: 'السنة النبوية',
      time: [DuaTime.day, DuaTime.night],
    ),
    DuaModel(
      count: 3,
      dua:
          "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً",
      benefit: 'كان حقاً على الله أن يرضيه يوم القيامة.',
      benefitSource:
          'حديث ثوبان رضي الله عنه، أخرجه أبو داود والترمذي وأحمد، وحسنه الألباني في (صحيح أبي داود 5072)',
      source: 'السنة النبوية',
      time: [DuaTime.day, DuaTime.night],
    ),
    DuaModel(
      count: 4,
      dua:
          "اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلائِكَتِك ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك",
      benefit: '',
      source: '',
      time: [DuaTime.day],
    ),
    DuaModel(
      count: 4,
      dua:
          "اللّهُـمَّ إِنِّـي أَمسيتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلائِكَتِك ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك",
      benefit: '',
      source: '',
      time: [DuaTime.night],
    ),
    DuaModel(
      dua:
          "اللّهُـمَّ ما أَصْبَـَحَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر",
      benefit: 'من قالها حين يصبح فقد أدى شكر يومه.',
      benefitSource:
          'حديث عبد الله بن غنام رضي الله عنه، أخرجه أبو داود والنسائي في الكبرى، وحسنه ابن حجر، وضعفه بعض المحدثين كالألباني، لكنه يُعمل به في فضائل الأعمال',
      source: 'السنة النبوية',
      time: [DuaTime.day],
    ),
    DuaModel(
      dua:
          "اللّهُـمَّ ما أَمسى بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر",
      benefit: 'من قالها حين يصبح فقد أدى شكر يومه.',
      benefitSource:
          'حديث عبد الله بن غنام رضي الله عنه، أخرجه أبو داود والنسائي في الكبرى، وحسنه ابن حجر، وضعفه بعض المحدثين كالألباني، لكنه يُعمل به في فضائل الأعمال',
      source: 'السنة النبوية',
      time: [DuaTime.night],
    ),
    DuaModel(
      count: 7,
      dua:
          "حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم",
      benefit: '',
      source: '',
      time: [.day, .night],
    ),
    DuaModel(
      count: 3,
      dua:
          "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم",
      benefit: '',
      source: '',
      time: [.day, .night],
    ),
    DuaModel(
      dua:
          "اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا ، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور",
      benefit: '',
      source: '',
      time: [DuaTime.day],
    ),
    DuaModel(
      dua:
          "اللّهُـمَّ بِكَ أَمْسَـينا وَبِكَ أَصْـبَحْنا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ الْمَصِيرُ",
      benefit: '',
      source: '',
      time: [DuaTime.night],
    ),
    DuaModel(
      dua:
          "أَصْبَـحْـنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ",
      benefit: '',
      source: '',
      time: [DuaTime.day],
    ),
    DuaModel(
      dua:
          "أَمْسَيْنَا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ",
      benefit: '',
      source: '',
      time: [DuaTime.night],
    ),

    /// continue here
    DuaModel(
      dua: 'سُبْحَانَ اللَّهِ وَبِحَمْدِهِ',
      count: 100,
      benefit:
          'حُطَّت خطاياه وإن كانت مثل زبد البحر، ولم يأتِ أحد يوم القيامة بأفضل مما جاء به إلا أحد قال مثل ما قال أو زاد عليه.',
      benefitSource:
          'حديث أبي هريرة رضي الله عنه، أخرجه الإمام مسلم في صحيحه (رقم 2692)',
      source: 'السنة النبوية',
      time: [DuaTime.day, .night],
    ),
    DuaModel(
      dua:
          'يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ، أَصْلِحْ لِي شَأْنِي كُلَّهُ، وَلا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ',
      benefit: 'تفويض الأمر لله وحفظ النفس من الضياع وتيسير كل أمور الحياة.',
      benefitSource:
          'حديث أنس بن مالك رضي الله عنه، أخرجه الحاكم والنسائي، وحسنه الألباني في (صحيح الجامع 5820)',
      source: 'السنة النبوية',
      time: [DuaTime.night, .day],
    ),
  ];

  static List<DuaModel> get allSupplications => _allAzkar;

  // Get Azkar by Time (Morning/Night/AfterSalah)
  static List<DuaModel> getAzkarByTime(DuaTime time) {
    return _allAzkar.where((item) {
      return item.time?.contains(time) ?? false;
    }).toList();
  }

  // Search functionality
  static List<DuaModel> searchAzkar(String query) {
    return _allAzkar.where((item) {
      return item.dua.contains(query) || (item.source.contains(query));
    }).toList();
  }
}
