import 'package:project_azkar/data/models/dua_model.dart';

import '../../utils/enums.dart';

abstract class AfterSalahRepo {
  static final List<DuaModel> _azkar = [
    DuaModel(
      count: 3,
      dua: 'أَسْتَغْفِرُ اللَّهَ (ثَلاَثَاً)',
      time: [DuaTime.afterPrayer],
      source: 'السنة النبوية',
      benefit:
          'سُنة نبوية عظيمة لجبر أي تقصير أو سهو أو خلل قد يقع من العبد أثناء أداء الصلاة',
      benefitSource:
          'عن ثوبانَ رضيَ اللهُ عنه مولَى رسولِ اللهِ ﷺ قال: "كان رسولُ اللهِ صلَّى اللهُ عليه وسلَّم إذا انصرَفَ مِن صلاتِه، استغفَرَ ثلاثًا، وقال: اللهمَّ أنتَ السَّلامُ، ومنك السَّلامُ، تبارَكْتَ يا ذا الجلالِ والإكرامِ. رواه مسلم"',
    ),

    DuaModel(
      dua:
          'اللَّهُمَّ أَنْتَ السَّلامُ، وَمِنْكَ السَّلامُ، تَبَارَكْتَ يَا ذَا الجَلالِ وَالإِكْرامِ',
      time: [DuaTime.afterPrayer],
      source: 'السنة النبوية',
      benefit:
          'ذكر يتضمن الثناء والتمجيد لله تعالى بالسلامة من كل نقص، والتعظيم لجلاله وإكرامه',
      benefitSource:
          'عن ثوبانَ رضيَ اللهُ عنه مولَى رسولِ اللهِ ﷺ قال: "كان رسولُ اللهِ صلَّى اللهُ عليه وسلَّم إذا انصرَفَ مِن صلاتِه، استغفَرَ ثلاثًا، وقال: اللهمَّ أنتَ السَّلامُ، ومنك السَّلامُ، تبارَكْتَ يا ذا الجلالِ والإكرامِ. رواه مسلم"',
    ),

    DuaModel(
      dua:
          'لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ [ثلاثاً]، اللَّهُمَّ لاَ مَانِعَ لِمَا أَعْطَيْتَ، وَلاَ مُعْطِيَ لِمَا مَنَعْتَ، وَلاَ يَنْفَعُ ذَا الْجَدِّ مِنْكَ الجَدُّ',
      time: [DuaTime.afterPrayer],
      source: 'السنة النبوية',
      benefit:
          'إقرار عظيم بوحدانية الله وقدرته المطلقة. سليم كامل بأن العطاء والمنع بيد الله وحده، فلا راد لفضله ولا معطي لما منع. أكيد على أن الغنى والحظ والجاه (الجد) لا تنفع صاحبها ولا تنجيه من عذاب الله، بل النافع هو الإيمان والعمل الصالح.',
      benefitSource:
          'عن المُغيرةِ بنِ شُعبةَ رضيَ اللهُ عنه، قال: "إنَّ النبيَّ صلَّى اللهُ عليه وسلَّم كان يقولُ في دُبُرِ كلِّ صلاةٍ مكتوبةٍ: لا إلهَ إلَّا اللهُ وحدَه لا شريكَ له، له المُلكُ، وله الحمدُ، وهو على كلِّ شيءٍ قديرٌ، اللهمَّ لا مانعَ لِما أعطَيْتَ، ولا مُعْطيَ لِما منَعْتَ، ولا ينفَعُ ذا الجَدِّ منك الجَدُّ". (أخرجه البخاري ومسلم)',
    ),

    DuaModel(
      dua: 'اللهمَّ أعِنِّي على ذِكرِكَ وشُكرِكَ وحُسْنِ عبادتِكَ',
      time: [DuaTime.afterPrayer],
      source: 'السنة النبوية',
      benefit:
          'وصية نبوية غالية من السنة النبوية، تتضمن الاستعانة بالله عز وجل على أعظم مقاصد الخلق: دوام الذكر، وشكر النعم، وإتقان العبادة والإخلاص فيها',
      benefitSource:
          'عن مُعاذِ بنِ جَبَلٍ رضيَ اللهُ عنه، قال: "إنَّ رسولَ اللهِ صلَّى اللهُ عليه وسلَّم أخَذَ بيدِه وقال: يا مُعاذُ، واللهِ إنِّي لَأُحِبُّك، واللهِ إنِّي لَأُحِبُّك، فقال: أُوصيكَ يا مُعاذُ؛ لا تَدَعَنَّ في دُبُرِ  كلِّ صلاةٍ تقولُ: اللهمَّ أعِنِّي على ذِكرِكَ وشُكرِكَ وحُسْنِ عبادتِكَ" أخرجه أبو داود، والنسائي، وأحمد',
    ),

    DuaModel(
      dua:
          'لَا إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ. لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ، لاَ إِلَهَ إِلاَّ اللَّهُ، وَلاَ نَعْبُدُ إِلاَّ إِيَّاهُ, لَهُ النِّعْمَةُ وَلَهُ الْفَضْلُ وَلَهُ الثَّنَاءُ الْحَسَنُ، لَا إِلَهَ إِلاَّ اللَّهُ مُخْلِصِينَ لَهُ الدِّينَ وَلَوْ كَرِهَ الكَافِرُونَ',
      time: [DuaTime.afterPrayer],
      source: 'السنة النبوية',
      benefit:
          'ذكر عظيم يشتمل على إعلان التوحيد الخالص لله، والتبرؤ من الحول والقوة إلا به، وإفراد الله بالعبادة والنعمة والفضل والثناء، وإخلاص الدين له',
      benefitSource:
          'عن عبد الله بن الزبير رضي الله عنهما، أنه كان يقول دُبُرَ كُلِّ صلاةٍ حينَ يُسلِّمُ هذا الذكر، ثم يقول: "كانَ رَسولُ اللهِ ﷺ يُهَلِّلُ بِهِنَّ دُبُرَ كُلِّ صَلاةٍ". (أخرجه مسلم في صحيحه)',
    ),

    DuaModel(
      dua:
          'سُبحانَ اللهِ ثلاثًا وثلاثينَ، والحمدُ للهِ ثلاثًا وثلاثينَ، واللهُ أكبَرُ ثلاثًا وثلاثينَ، ولا إلهَ إلَّا اللهُ وحدَه لا شريكَ له، له المُلكُ وله الحمدُ، وهو على كلِّ شيءٍ قديرٌ، مرَّةً تمامَ المائةِ',
      time: [DuaTime.afterPrayer],
      source: 'السنة النبوية',
      benefit: 'من قال ذلك دبر كل صلاة غفرت خطاياه وإن كانت مثل زبد البحر',
      benefitSource:
          'عن أبي هريرةَ رضي الله عنه، عن رسولِ اللهِ صلَّى اللهُ عليه وسلَّم قال: "من سَبَّحَ اللهَ في دبُرِ كُلِّ صلاةٍ ثلاثًا وثلاثينَ، وحَمِدَ الله ثلاثًا وثلاثينَ، وكبَّرَ اللهَ ثلاثًا وثلاثينَ، فتلك تسِعةٌ وتسعونَ، وقال تمامَ المائةِ: لا إلهَ إلَّا الله وحدَه لا شريكَ له، له الملكُ وله الحمدُ، وهو على كلِّ شَيءٍ قَديرٌ، غُفِرَت خطاياه وإن كانت مِثلَ زَبَدِ البَحرِ" رواه مسلم',
    ),

    DuaModel(
      dua:
          "اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ",
      time: [DuaTime.afterPrayer],
      source: "آية الكرسى - البقرة: ٢٥٥",
      benefit:
          'مَن قرأَ آيةَ الكُرسيِّ دُبُرَ كلِّ صلاةٍ مكتوبةٍ، لم يمنَعْه مِن دخولِ الجنَّةِ إلَّا الموتُ',
      benefitSource:
          'عن أبي أُمامةَ الباهليِّ رضيَ اللهُ عنه، قال: قال رسولُ اللهِ صلَّى اللهُ عليه وسلَّم: "مَن قرأَ آيةَ الكُرسيِّ دُبُرَ كلِّ صلاةٍ مكتوبةٍ، لم يمنَعْه مِن دخولِ الجنَّةِ إلَّا الموتُ. أخرجه النسائي في (السنن الكبرى 9848)، والروياني في (المسند 1268)"',
    ),
    DuaModel(
      dua:
          "قُلْ هُوَ اللَّهُ أَحَدٌ، اللَّهُ الصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُ كُفُواً أَحَدٌ <<٣ مرات بعد صلاة الفجر و المغرب>>",
      time: [DuaTime.afterPrayer],
      source: "سورة الإخلاص",
      benefit:
          'حصن عظيم من القرآن الكريم يقي المسلم من شرور الإنس والجن، والسحر، والحسد، ويكفيه من كل سوء بعد كل فريضة',
      benefitSource:
          'عن عقبة بن عامر رضي الله عنه قال: "أَمَرني رسولُ اللهِ ﷺ أنْ أَقرَأَ بالمُعوِّذاتِ دُبُرَ كُلِّ صَلاةٍ". (أخرجه أبو داود، والترمذي، والنسائي، وصححه الألباني)',
    ),
    DuaModel(
      dua:
          "قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ <<٣ مرات بعد صلاة الفجر و المغرب>>",
      time: [DuaTime.afterPrayer],
      source: "سورة الفلق",
      benefit:
          'حصن عظيم من القرآن الكريم يقي المسلم من شرور الإنس والجن، والسحر، والحسد، ويكفيه من كل سوء بعد كل فريضة',
      benefitSource:
          'عن عقبة بن عامر رضي الله عنه قال: "أَمَرني رسولُ اللهِ ﷺ أنْ أَقرَأَ بالمُعوِّذاتِ دُبُرَ كُلِّ صَلاةٍ". (أخرجه أبو داود، والترمذي، والنسائي، وصححه الألباني)',
    ),
    DuaModel(
      dua:
          "قُلْ أَعُوذُ بِرَبِّ النَّاسِ، مَلِكِ النَّاسِ، إِلَهِ النَّاسِ، مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ، الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ، مِنَ الْجِنَّةِ وَالنَّاسِ <<٣ مرات بعد صلاة الفجر و المغرب>>",
      time: [DuaTime.afterPrayer],
      source: "سورة الناس",
      benefit:
          'حصن عظيم من القرآن الكريم يقي المسلم من شرور الإنس والجن، والسحر، والحسد، ويكفيه من كل سوء بعد كل فريضة',
      benefitSource:
          'عن عقبة بن عامر رضي الله عنه قال: "أَمَرني رسولُ اللهِ ﷺ أنْ أَقرَأَ بالمُعوِّذاتِ دُبُرَ كُلِّ صَلاةٍ". (أخرجه أبو داود، والترمذي، والنسائي، وصححه الألباني)',
    ),

    DuaModel(
      dua:
          'لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ. <<عَشْرَ مَرّاتٍ بَعْدَ صَلاةِ الْمَغْرِبِ وَالصُّبْحِ>>',
      time: [DuaTime.afterPrayer],
      source: 'السنة النبوية',
      benefit: '',
      benefitSource: 'رواه الترمذي، ٥/ ٥١٥، برقم ٣٤٧٤، وأحمد، ٤/ ٢٢٧',
    ),

    DuaModel(
      dua:
          'اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نافِعاً، وَرِزْقاً طَيِّباً، وَعَمَلاً مُتَقَبَّلاً. <<بَعْدَ السّلامِ مِنْ صَلاَةِ الفَجْرِ>>',
      time: [DuaTime.afterPrayer],
      source: 'السنة النبوية',
      benefit: '',
      benefitSource: 'ابن ماجه، برقم ٩٢٥، والنسائي في عمل اليوم والليلة',
    ),
  ];

  static List<DuaModel> get azkar => _azkar;
}
