import 'package:project_azkar/data/models/dua_model.dart';

import '../../utils/enums.dart';

abstract class DayNightZekrRepo {
  static final List<DuaModel> _azkar = [
    DuaModel(
      dua:
          "اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ",
      time: [DuaTime.day, DuaTime.night],
      source: "آية الكرسى - البقرة: ٢٥٥",
      benefit:
          "من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح.",
      benefitSource:
          'حديث أُبي بن كعب رضي الله عنه، أخرجه الحاكم والطبراني، وصححه الألباني في (صحيح الترغيب والترهيب)',
    ),
    DuaModel(
      count: 3,
      dua:
          "قُلْ هُوَ اللَّهُ أَحَدٌ، اللَّهُ الصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُ كُفُواً أَحَدٌ",
      time: [DuaTime.day, DuaTime.night],
      source: "سورة الإخلاص",
      benefit: "من قالها ثلاث مرات حين يصبح وحين يمسي كفته من كل شيء",
      benefitSource:
          'حديث عبد الله بن خبيب رضي الله عنه، قال رسول الله ﷺ: "قل هو الله أحد والمعوذتين حين تمسي وحين تصبح ثلاث مرات تكفيك من كل شيء". أخرجه أبو داود والترمذي والنسائي، وصححه الألباني في (صحيح أبي داود 5082).',
    ),
    DuaModel(
      count: 3,
      dua:
          "قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ",
      time: [DuaTime.day, DuaTime.night],
      source: "سورة الفلق",
      benefit: "من قالها ثلاث مرات حين يصبح وحين يمسي كفته من كل شيء",
      benefitSource:
          'حديث عبد الله بن خبيب رضي الله عنه، قال رسول الله ﷺ: "قل هو الله أحد والمعوذتين حين تمسي وحين تصبح ثلاث مرات تكفيك من كل شيء". أخرجه أبو داود والترمذي والنسائي، وصححه الألباني في (صحيح أبي داود 5082).',
    ),
    DuaModel(
      count: 3,
      dua:
          "قُلْ أَعُوذُ بِرَبِّ النَّاسِ، مَلِكِ النَّاسِ، إِلَهِ النَّاسِ، مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ، الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ، مِنَ الْجِنَّةِ وَالنَّاسِ",
      time: [DuaTime.day, DuaTime.night],
      source: "سورة الناس",
      benefit: "من قالها ثلاث مرات حين يصبح وحين يمسي كفته من كل شيء",
      benefitSource:
          'حديث عبد الله بن خبيب رضي الله عنه، قال رسول الله ﷺ: "قل هو الله أحد والمعوذتين حين تمسي وحين تصبح ثلاث مرات تكفيك من كل شيء". أخرجه أبو داود والترمذي والنسائي، وصححه الألباني في (صحيح أبي داود 5082).',
    ),

    DuaModel(
      dua:
          'أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ، لاَ إِلَهَ إلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذَا الْيَوْمِ وَخَيرَ مَا بَعْدَهُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذَا الْيَوْمِ وَشَرِّ مَا بَعْدَهُ، رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ، رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ',
      time: [DuaTime.day],
      source: 'السنة النبوية',
      benefit:
          'تجديد الإقرار لله بالملك والوحدانية، وسؤال الله خير اليوم وما بعده',
      benefitSource:
          'عن عبد الله بن مسعود رضي الله عنه قال: كانَ نَبِيُّ اللهِ ﷺ إذَا أَمْسَى قالَ... وإذَا أَصْبَحَ قالَ ذلكَ أَيْضًا. (أخرجه مسلم)',
    ),
    DuaModel(
      dua:
          "أَمْسَيْـنا وَأَمْسـى المـلكُ لله وَالْحَمْدُ لِلَّهِ، لاَ إِلَهَ إلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هـذهِ اللَّـيْلَة وَخَيرَ مَا بَعْـدَهـا ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هـذهِ اللَّـيْلةِ وَشَرِّ مَا بَعْـدَهـا ، رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ، رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ",
      time: [DuaTime.night],
      source: 'السنة النبوية',
      benefit:
          'تجديد الإقرار لله بالملك والوحدانية، وسؤال الله خير اليوم وما بعده',
      benefitSource:
          'عن عبد الله بن مسعود رضي الله عنه قال: كانَ نَبِيُّ اللهِ ﷺ إذَا أَمْسَى قالَ... وإذَا أَصْبَحَ قالَ ذلكَ أَيْضًا. (أخرجه مسلم)',
    ),

    DuaModel(
      dua:
          'اللَّهُمَّ بِكَ أَصْبَحْنَا، وَبِكَ أَمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ وَإِلَيْكَ النُّشُورُ',
      time: [DuaTime.day],
      source: 'السنة النبوية',
      benefit:
          'الاعتراف بكمال قدرة الله وافتقار العبد لربه في كل أحواله وتقلباته (صباحه ومسائه، وحياته وموته)، وتذكُّر البعث والوقوف بين يدي الله عز وجل',
      benefitSource:
          'عن أبي هريرة رضي الله عنه، أن النبي ﷺ كان يقولُ إذا أصبَحَ: "اللَّهمَّ بك أصبَحْنا وبك أمسَينا، وبك نَحيا وبك نَموتُ، وإليك النُّشورُ"، وإذا أمسَى قال: "اللَّهمَّ بك أمسَينا وبك أصبَحْنا، وبك نَحيا وبك نَموتُ، وإليك المَصيرُ".  الترمذي، ٥/ ٤٦٦، برقم ٣٣٩١',
    ),
    DuaModel(
      dua:
          "اللّهُـمَّ بِكَ أَمْسَـينا وَبِكَ أَصْـبَحْنا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ الْمَصِيرُ",
      time: [DuaTime.night],
      source: 'السنة النبوية',
      benefit:
          'الاعتراف بكمال قدرة الله وافتقار العبد لربه في كل أحواله وتقلباته (صباحه ومسائه، وحياته وموته)، وتذكُّر البعث والوقوف بين يدي الله عز وجل',
      benefitSource:
          'عن أبي هريرة رضي الله عنه، أن النبي ﷺ كان يقولُ إذا أصبَحَ: "اللَّهمَّ بك أصبَحْنا وبك أمسَينا، وبك نَحيا وبك نَموتُ، وإليك النُّشورُ"، وإذا أمسَى قال: "اللَّهمَّ بك أمسَينا وبك أصبَحْنا، وبك نَحيا وبك نَموتُ، وإليك المَصيرُ".  الترمذي، ٥/ ٤٦٦، برقم ٣٣٩١',
    ),

    DuaModel(
      dua:
          'اللَّهُمَّ أَنْتَ رَبِّي لَا إِلَهَ إِلاَّ أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لاَ يَغْفِرُ الذُّنوبَ إِلاَّ أَنْتَ',
      time: [DuaTime.day, DuaTime.night],
      source: 'سيد الاستغفار',
      benefit:
          'من قالها موقناً بها حين يمسي، فمات من ليلته دخل الجنة، وكذلك إذا أصبح',
      benefitSource:
          'حديث شداد بن أوس رضي الله عنه، أن النبي ﷺ قال: "سيد الاستغفار أن تقول: اللهم أنت ربي... ومَن قالَها مِنَ النَّهارِ مُوقِنًا بها، فَماتَ مِن يَومِهِ قَبْلَ أنْ يُمْسِيَ، فَهو مِن أهْلِ الجَنَّةِ، ومَن قالَها مِنَ اللَّيْلِ وهو مُوقِنٌ بها، فَماتَ قَبْلَ أنْ يُصْبِحَ، فَهو مِن أهْلِ الجَنَّةِ"، أخرجه الإمام البخاري في صحيحه (رقم 6306)',
    ),

    DuaModel(
      count: 4,
      dua:
          'اللَّهُمَّ إِنِّي أَصْبَحْتُ أُشْهِدُكَ، وَأُشْهِدُ حَمَلَةَ عَرْشِكَ، وَمَلاَئِكَتِكَ، وَجَمِيعَ خَلْقِكَ، أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلاَّ أَنْتَ وَحْدَكَ لاَ شَرِيكَ لَكَ، وَأَنَّ مُحَمَّداً عَبْدُكَ وَرَسُولُكَ',
      time: [DuaTime.day],
      source: 'السنة النبوية',
      benefit: 'من قالها حين يصبح، أو يمسي أربع مرات، أعتقه اللَّه من النار',
      benefitSource:
          'حديث أنس بن مالك رضي الله عنه أن النبي ﷺ قال: "مَن قال حِينَ يُصبِحُ، أو حِينَ يُمسي: اللَّهُمَّ إني أصبَحتُ أُشهِدُكَ... أعتَقَ اللهُ رُبُعَهُ مِن النَّارِ، فمَن قالها مَرَّتَينِ أعتَقَ اللهُ نِصفَهُ، ومَن قالها ثَلاثًا أعتَقَ اللهُ ثَلاثَةَ أرباعِهِ، فإنْ قالها أربَعًا أعتَقَهُ اللهُ مِن النَّارِ". (أخرجه أبو داود، ٤/ ٣١٧، برقم ٥٠٧١، والبخاري في الأدب المفرد، برقم ١٢٠١، والنسائي في عمل اليوم والليلة)',
    ),
    DuaModel(
      count: 4,
      dua:
          'اللَّهُمَّ إِنِّـي أَمسيتُ أُشْهِدُكَ، وَأُشْهِدُ حَمَلَةَ عَرْشِكَ، وَمَلاَئِكَتِكَ، وَجَمِيعَ خَلْقِكَ، أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلاَّ أَنْتَ وَحْدَكَ لاَ شَرِيكَ لَكَ، وَأَنَّ مُحَمَّداً عَبْدُكَ وَرَسُولُكَ',
      time: [DuaTime.night],
      source: 'السنة النبوية',
      benefit: 'من قالها حين يصبح، أو يمسي أربع مرات، أعتقه اللَّه من النار',
      benefitSource:
          'حديث أنس بن مالك رضي الله عنه أن النبي ﷺ قال: "مَن قال حِينَ يُصبِحُ، أو حِينَ يُمسي: اللَّهُمَّ إني أصبَحتُ أُشهِدُكَ... أعتَقَ اللهُ رُبُعَهُ مِن النَّارِ، فمَن قالها مَرَّتَينِ أعتَقَ اللهُ نِصفَهُ، ومَن قالها ثَلاثًا أعتَقَ اللهُ ثَلاثَةَ أرباعِهِ، فإنْ قالها أربَعًا أعتَقَهُ اللهُ مِن النَّارِ". (أخرجه أبو داود، ٤/ ٣١٧، برقم ٥٠٧١، والبخاري في الأدب المفرد، برقم ١٢٠١، والنسائي في عمل اليوم والليلة)',
    ),

    DuaModel(
      dua:
          'اللَّهُمَّ مَا أَصْبَحَ بِي مِنْ نِعْمَةٍ أَوْ بِأَحَدٍ مِنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ لاَ شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ',
      time: [DuaTime.day],
      source: 'السنة النبوية',
      benefit:
          'من قالها حين يصبح فقد أدَّى شكر يومه، ومن قالها حين يمسي فقد أدَّى شكر ليلته',
      benefitSource:
          'حديث عبد الله بن غنام البياضي رضي الله عنه، أن النبي ﷺ قال: "مَن قال حينَ يُصبِحُ: اللَّهمَّ ما أصبَح بي مِن نِعمةٍ... فقد أدَّى شُكْرَ يَومِهِ، ومَن قال مِثلَ ذلكَ حينَ يُمسي فقد أدَّى شُكْرَ لَيلَتِهِ". (أخرجه أبو داود)',
    ),
    DuaModel(
      dua:
          "اللَّهُمَّ مَا أَمسى بِي مِنْ نِعْمَةٍ أَوْ بِأَحَدٍ مِنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ لاَ شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ",
      time: [DuaTime.night],
      source: 'السنة النبوية',
      benefit:
          'من قالها حين يصبح فقد أدَّى شكر يومه، ومن قالها حين يمسي فقد أدَّى شكر ليلته',
      benefitSource:
          'حديث عبد الله بن غنام البياضي رضي الله عنه، أن النبي ﷺ قال: "مَن قال حينَ يُصبِحُ: اللَّهمَّ ما أصبَح بي مِن نِعمةٍ... فقد أدَّى شُكْرَ يَومِهِ، ومَن قال مِثلَ ذلكَ حينَ يُمسي فقد أدَّى شُكْرَ لَيلَتِهِ". (أخرجه أبو داود)',
    ),

    DuaModel(
      count: 3,
      dua:
          'اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لاَ إِلَهَ إِلاَّ أَنْتَ. اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ، وَالفَقْرِ، وَأَعُوذُ بِكَ مِنْ عَذَابِ القَبْرِ، لاَ إِلَهَ إِلاَّ أَنْتَ',
      time: [DuaTime.day, .night],
      source: 'السنة النبوية',
      benefit:
          'سؤال الله تمام العافية والسلامة في الجسد والحواس (السمع والبصر) ليتقوى بها العبد على طاعة الله',
      benefitSource:
          'عن عبد الرحمن بن أبي بكرة، أنَّه قال لأبيه: يا أَبَتِ، إنِّي أسمعُك تدعو كلَّ غَداةٍ: اللَّهمَّ عافِني في بَدَني، اللَّهمَّ عافِني في سَمْعي، اللَّهمَّ عافِني في بَصَري، لا إلهَ إلَّا أنتَ... تُعيدُها ثلاثًا حين تُصبِحُ، وثلاثًا حين تُمسي! فقال: إنِّي سَمِعتُ رسولَ اللهِ ﷺ يَدعو بهِنَّ، فأنا أُحِبُّ أنْ أستَنَّ بسُنَّتِه. (أبو داود، ٤/ ٣٢٤، برقم ٥٠٩٢، وأحمد، ٥/ ٤٢، برقم ٢٠٤٣٠، والنسائي في عمل اليوم والليلة)',
    ),

    DuaModel(
      count: 7,
      dua:
          'حَسْبِيَ اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ عَلَيهِ تَوَكَّلتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ',
      time: [.day, .night],
      source: 'السنة النبوية',
      benefit:
          'من قالها حين يصبح وحين يمسي سبع مرات كفاه اللَّه ما أهمّه من أمر الدنيا والآخرة',
      benefitSource:
          'عن أبي الدرداء رضي الله عنه أن النبي ﷺ قال: "مَن قال إذا أصبَحَ وإذا أمسَى: حَسبيَ اللهُ لا إلهَ إلَّا هو عليه تَوكَّلتُ وهو رَبُّ العَرشِ العَظيمِ، سَبعَ مرَّاتٍ، كَفاهُ اللهُ ما أهَمَّهُ صادِقًا كان بها أو كاذِبًا". (أخرجه ابن السني، برقم ٧١ مرفوعاً، وأبو داود موقوفاً، ٤/ ٣٢١، برقم ٥٠٨١)',
    ),

    DuaModel(
      dua:
          'اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ: فِي دِينِي وَدُنْيَايَ وَأَهْلِي، وَمَالِي، اللَّهُمَّ اسْتُرْ عَوْرَاتِي، وَآمِنْ رَوْعَاتِي، اللَّهُمَّ احْفَظْنِي مِنْ بَينِ يَدَيَّ، وَمِنْ خَلْفِي، وَعَنْ يَمِينِي، وَعَنْ شِمَالِي، وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي',
      time: [DuaTime.day, .night],
      source: 'السنة النبوية',
      benefit:
          'سؤال الله العفو والعافية في جميع شؤون العبد، وتحصين شامل بحفظ الله ورعايته للإنسان من جميع الجهات و الستر',
      benefitSource: '(أخرجه أبو داود، وابن ماجه)',
    ),

    DuaModel(
      dua:
          'اللَّهُمَّ عَالِمَ الغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطانِ وَشَرَكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءاً، أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ',
      time: [.day, .night],
      source: 'السنة النبوية',
      benefit:
          'التوسل لله بأسمائه وصفاته العظيمة، والاستعاذة والتحصن بالله من أصول الشرور جميعاً',
      benefitSource:
          'عن أبي بكر الصديق رضي الله عنه، أنه قال: يا رسولَ اللهِ، مُرْني بكَلِماتٍ أقولُهنَّ إذا أصبَحتُ وإذا أمسَيتُ... (أخرجه أبو داود، والترمذي)',
    ),

    DuaModel(
      count: 3,
      dua:
          'بِسْمِ اللَّهِ الَّذِي لاَ يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلاَ فِي السّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ',
      time: [.day, .night],
      source: 'السنة النبوية',
      benefit: 'من قالها ثلاثاً إذا أصبح، وثلاثاً إذا أمسى لم يضره شيء',
      benefitSource:
          '(أخرجه أبو داود، ٤/ ٣٢٣، برقم، ٥٠٨٨، والترمذي، ٥/ ٤٦٥، برقم ٣٣٨٨، وابن ماجه، برقم ٣٨٦٩)',
    ),

    DuaModel(
      count: 3,
      dua:
          'رَضِيتُ بِاللَّهِ رَبَّاً، وَبِالْإِسْلاَمِ دِيناً، وَبِمُحَمَّدٍ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - نَبِيّاً',
      time: [DuaTime.day, DuaTime.night],
      source: 'السنة النبوية',
      benefit:
          'من قالها ثلاثاً حين يصبح وثلاثاً حين يمسي كان حقاً على اللَّه أن يرضيه يوم القيامة',
      benefitSource:
          'حديث ثوبان مولى رسول الله ﷺ قال: سمعت رسول الله ﷺ يقول: "مَن قال حين يُمسي وحين يُصبحُ: رضيتُ باللهِ ربًّا وبالإسلامِ دينًا وبمحمدٍ نبيًّا، كان حقًّا على اللهِ أن يُرضيَه"، (أخرجه أبو داود والترمذي وأحمد)',
    ),

    DuaModel(
      dua:
          'يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغيثُ أَصْلِحْ لِي شَأْنِيَ كُلَّهُ وَلاَ تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ',
      time: [DuaTime.night, .day],
      source: 'السنة النبوية',
      benefit: 'تفويض الأمر لله وحفظ النفس من الضياع وتيسير كل أمور الحياة',
      benefitSource: '(الحاكم وصححه، ووافقه الذهبي، ١/ ٥٤٥)',
    ),

    DuaModel(
      dua:
          'َصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ رَبِّ الْعَالَمِينَ، اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ هَذَا الْيَوْمِ: فَتْحَهُ، وَنَصْرَهُ، وَنورَهُ، وَبَرَكَتَهُ، وَهُدَاهُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِيهِ وَشَرِّ مَا بَعْدَهُ',
      time: [.day],
      source: 'السنة النبوية',
      benefit:
          'دعاء جامع يفتتح به المسلم يومه مفوضاً أمره لله، وسائلاً إياه مجامع الخير من التوفيق والرزق والنور والبركة والهداية، ومستعيذاً بحفظه من كل مكروه وشر يقع في هذا اليوم أو فيما يليه',
      benefitSource:
          'عن أبي مالك الأشعري رضي الله عنه، أن رسول الله ﷺ قال: "إذا أصبَحَ أحدُكُم فليقُلْ: أصبَحْنا وأصبَحَ المُلكُ للهِ ربِّ العالَمينَ، اللَّهمَّ إنِّي أسألُكَ خَيرَ هذا اليومِ فَتحَهُ، ونَصرَهُ، ونورَهُ، وبَرَكَتَهُ، وهُداهُ، وأعوذُ بِكَ مِن شَرِّ ما فيهِ وشَرِّ ما بَعدَهُ، ثُمَّ إذا أمسى فليقُلْ مِثلَ ذلكَ". (أخرجه أبو داود، ٤/ ٣٢٢، برقم ٥٠٨٤، وحسن إسناده شعيب وعبد القادر الأرناؤوط في تحقيق زاد المعاد، ٢/ ٣٧٣)',
    ),
    DuaModel(
      dua:
          'أَمْسَيْنا وَأَمْسَى الْمُلْكُ لِلَّهِ رَبِّ الْعَالَمِينَ، اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ هَذَه اللَّيْلَةِ: فَتْحُهَا وَنُصَرُّهَا، وَنورَهُا و برَكَتَهُا، وَهُداهُا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فيهِا وَشَرِّ مَا بَعْدَهَا',
      time: [.night],
      source: 'السنة النبوية',
      benefit:
          'دعاء جامع يفتتح به المسلم يومه مفوضاً أمره لله، وسائلاً إياه مجامع الخير من التوفيق والرزق والنور والبركة والهداية، ومستعيذاً بحفظه من كل مكروه وشر يقع في هذا اليوم أو فيما يليه',
      benefitSource:
          'عن أبي مالك الأشعري رضي الله عنه، أن رسول الله ﷺ قال: "إذا أصبَحَ أحدُكُم فليقُلْ: أصبَحْنا وأصبَحَ المُلكُ للهِ ربِّ العالَمينَ، اللَّهمَّ إنِّي أسألُكَ خَيرَ هذا اليومِ فَتحَهُ، ونَصرَهُ، ونورَهُ، وبَرَكَتَهُ، وهُداهُ، وأعوذُ بِكَ مِن شَرِّ ما فيهِ وشَرِّ ما بَعدَهُ، ثُمَّ إذا أمسى فليقُلْ مِثلَ ذلكَ". (أخرجه أبو داود، ٤/ ٣٢٢، برقم ٥٠٨٤، وحسن إسناده شعيب وعبد القادر الأرناؤوط في تحقيق زاد المعاد، ٢/ ٣٧٣)',
    ),

    DuaModel(
      dua:
          'َصْبَحْنا عَلَى فِطْرَةِ الْإِسْلاَمِ، وَعَلَى كَلِمَةِ الْإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ -، وَعَلَى مِلَّةِ أَبِينَا إِبْرَاهِيمَ، حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ الْمُشرِكِينَ',
      time: [DuaTime.day],
      source: 'السنة النبوية',
      benefit:
          'تجديد العهد مع الله يومياً على الثبات على دين الإسلام، والتمسك بالتوحيد الخالص (كلمة الإخلاص: لا إله إلا الله)، واتباع هدي النبي ﷺ وسنته، والالتزام بملة إبراهيم عليه السلام في إخلاص العبادة لله والبراءة التامة من الشرك وأهله',
      benefitSource:
          'عن عبد الرحمن بن أبزى رضي الله عنه قال: كانَ النَّبيُّ ﷺ يقولُ إذا أصبَحَ وإذا أمسَى: "أصبَحْنا على فِطْرةِ الإسلامِ، وكَلمةِ الإخلاصِ، ودِينِ نَبيِّنا محمَّدٍ صلَّى اللهُ عليه وسلَّمَ، ومِلَّةِ أبينا إبراهيمَ حَنيفًا مُسلِمًا، وما كان مِنَ المُشرِكينَ". (أحمد، ٣/ ٤٠٦، و٤٠٧، برقم ١٥٣٦٠، ورقم ١٥٥٦٣، وابن السني في عمل اليوم والليلة)',
    ),
    DuaModel(
      dua:
          "أَمْسَيْنَا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الْإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ -، وَعَلَى مِلَّةِ أَبِينَا إِبْرَاهِيمَ، حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ الْمُشرِكِينَ",
      time: [DuaTime.night],
      source: 'السنة النبوية',
      benefit:
          'تجديد العهد مع الله يومياً على الثبات على دين الإسلام، والتمسك بالتوحيد الخالص (كلمة الإخلاص: لا إله إلا الله)، واتباع هدي النبي ﷺ وسنته، والالتزام بملة إبراهيم عليه السلام في إخلاص العبادة لله والبراءة التامة من الشرك وأهله',
      benefitSource:
          'عن عبد الرحمن بن أبزى رضي الله عنه قال: كانَ النَّبيُّ ﷺ يقولُ إذا أصبَحَ وإذا أمسَى: "أصبَحْنا على فِطْرةِ الإسلامِ، وكَلمةِ الإخلاصِ، ودِينِ نَبيِّنا محمَّدٍ صلَّى اللهُ عليه وسلَّمَ، ومِلَّةِ أبينا إبراهيمَ حَنيفًا مُسلِمًا، وما كان مِنَ المُشرِكينَ". (أحمد، ٣/ ٤٠٦، و٤٠٧، برقم ١٥٣٦٠، ورقم ١٥٥٦٣، وابن السني في عمل اليوم والليلة)',
    ),

    DuaModel(
      count: 100,
      dua:
          'لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ',
      time: [.day],
      source: 'السنة النبوية',
      benefit:
          'من قالها مائة مرة في يوم كانت له عدل عشر رقاب، وكُتِبَ له مائة حسنة، ومُحيت عنه مائة سيئة، وكانت له حرزاً من الشيطان يومه ذلك حتى يمسي، ولم يأت أحد بأفضل مما جاء به إلا أحد عمل أكثر من ذلك',

      benefitSource: '(البخاري، ٤/ ٩٥، برقم ٣٢٩٣، ومسلم، ٤/ ٢٠٧١، برقم ٢٦٩١)',
    ),
    DuaModel(
      count: 10,
      dua:
          'لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ',
      time: [.night],
      source: 'السنة النبوية',
      benefit: 'ذكر عظيم ويكون حرزاً وقايةً للعبد من الشيطان',
      benefitSource:
          '(النسائي في عمل اليوم والليلة، برقم ٢٤، أبو داود، برقم ٥٠٧٧)',
    ),

    DuaModel(
      count: 3,
      dua:
          'سُبْحَانَ اللَّهِ وَبِحَمْدِهِ: عَدَدَ خَلْقِهِ، وَرِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ، وَمِدَادَ كَلِمَاتِهِ',
      time: [DuaTime.day],
      source: 'السنة النبوية',
      benefit: '',
      benefitSource: '(أخرجه مسلم)',
    ),

    DuaModel(
      dua:
          'اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعاً، وَرِزْقاً طَيِّباً، وَعَمَلاً مُتَقَبَّلاً',
      time: [DuaTime.day],
      source: 'السنة النبوية',
      benefit: '',
      benefitSource:
          '(أخرجه ابن السني في عمل اليوم والليلة، برقم ٥٤، وابن ماجه، برقم ٩٢٥)',
    ),

    DuaModel(
      count: 100,
      dua: 'أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ',
      time: [.day],
      source: 'السنة النبوية',
      benefit: 'مِائَةَ مَرَّةٍ فِي الْيَوْمِ',
      benefitSource:
          '(البخاري مع الفتح، ١١/ ١٠١، برقم ٦٣٠٧، ومسلم، / ٢٠٧٥، برقم ٢٧٠٢)',
    ),

    DuaModel(
      count: 3,
      dua: 'أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ',
      time: [.night],
      source: 'السنة النبوية',
      benefit: 'من قالها حين يمسي ثلاث مرات لم تضرّه حُمَة تلك الليلة',
      benefitSource:
          'عن أبي هريرة رضي الله عنه قال: جاء رجلٌ إلى النبيِّ ﷺ فقال: يا رسولَ اللهِ، ما لَقِيتُ مِن عَقربٍ لَدَغَتْني البارحةَ! قال: "أَما لو قُلتَ حينَ أَمسَيتَ: أَعُوذُ بكَلِماتِ اللهِ التَّامَّاتِ مِن شَرِّ ما خَلَقَ، لم تَضُرَّكَ". (أخرجه أحمد، ٢/ ٢٩٠، برقم ٧٨٩٨، والنسائي في عمل اليوم والليلة، برقم ٥٩٠)',
    ),

    DuaModel(
      count: 10,
      dua: 'اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد',
      time: [.day, .night],
      source: 'السنة النبوية',
      benefit: 'إدراك شفاعة النبي ﷺ والفوز بها يوم القيامة',
      benefitSource:
          'عن أبي الدرداء رضي الله عنه أن النبي ﷺ قال: "مَن صلَّى عليَّ حينَ يُصبِحُ عَشرًا، وحينَ يُمسي عَشرًا، أدرَكَتهُ شَفاعَتي يومَ القيامةِ". (أخرجه الطبراني)',
    ),

    DuaModel(
      count: 100,
      dua: 'سُبْحَانَ اللَّهِ وَبِحَمْدِهِ',
      time: [DuaTime.day, .night],
      source: 'السنة النبوية',
      benefit:
          'حُطَّت خطاياه وإن كانت مثل زبد البحر، ولم يأتِ أحد يوم القيامة بأفضل مما جاء به إلا أحد قال مثل ما قال أو زاد عليه.',
      benefitSource:
          'عن أبي هريرة رضي الله عنه أن رسول الله ﷺ قال: "مَن قال: سُبحانَ اللهِ وبحمدِهِ في يومِ مِائةَ مرَّةٍ، حُطَّتْ خطاياهُ وإنْ كانتْ مثلَ زَبَدِ البحرِ". (أخرجه البخاري ومسلم)',
    ),
  ];

  static List<DuaModel> get azkar => _azkar;
}


   // DuaModel(
    //   dua:
    //       'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ',
    //   time: [.day, .night],
    //   source: 'السنة النبوية',
    //   benefit: 'تحصين نبوي شامل يجمع الاستعاذة من مكاره النفوس والقلوب',
    //   benefitSource:
    //       'عن أنس بن مالك رضي الله عنه قال: كان النبي ﷺ يقول: "اللَّهُمَّ إنِّي أعوذُ بكَ مِنَ الهَمِّ والحَزَنِ..." (أخرجه البخاري)',
    // ),

    // DuaModel(
    //   count: 3,
    //   dua:
    //       'أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ',
    //   time: [.day, .night],
    //   source: 'السنة النبوية',
    //   benefit:
    //       'ذكر عظيم يجمع بين توحيد الله وإثبات أسمائه الحسنى، ويُكفر به العبد ذنوبه',
    //   benefitSource:
    //       'عن بلال بن يسار بن زيد، عن أبيه، عن جده أنه سمع النبي ﷺ يقول: "مَن قال: أستغفرُ اللهَ العظيمَ الَّذي لا إله إلَّا هو الحيَّ القيومَ وأتوب إليه؛ غُفِر له وإن كان فرَّ من الزَّحفِ". (أخرجه أبو داود، والترمذي، والحاكم، وصححه الألباني)',
    // ),