import 'package:project_azkar/data/models/dua_model.dart';

import '../../utils/enums.dart';

//٠ ٠ ١ ٢ ٣ ٤ ٥ ٦ ٧ ٨ ٩

class MoodSupplicationsRepo {
  static final List<DuaModel> _allMoodSupplications = [
    //? ANGER
    DuaModel(
      dua: 'أَعُوْذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيْمِ',
      source: 'السنة النبوية',
      benefit: 'إطفاء نيران الغضب وسكون النفس',
      benefitSource:
          'كُنتُ جالِسًا مع النَّبيِّ صلَّى اللهُ عليه وسلَّم ورَجُلانِ يَستَبَّانِ، فأحَدُهما احمَرَّ وجهُه، وانتَفَخَت أوداجُه، فقال النَّبيُّ صلَّى اللهُ عليه وسلَّم: إنِّي لَأعلَمُ كَلِمةً لو قالها ذَهَبَ عنه ما يَجِدُ، لو قال: أعوذُ باللهِ مِنَ الشَّيطانِ ذَهَبَ عنه ما يَجِدُ، فقالوا له: إنَّ النَّبيَّ صلَّى اللهُ عليه وسلَّم قال: تَعَوَّذْ باللهِ مِنَ الشَّيطانِ، فقال: وهل بي جُنونٌ. (الراوي : سليمان بن صرد، المصدر : صحيح البخاري)',
      categories: [.anger],
    ),
    DuaModel(
      dua:
          'رَبِّ أَعُوْذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِيْنِ ، وَأَعُوذُ بِكَ رَبِّ أَنْ يَحَْضُرُوْنِ',
      source: "سورة المؤمنون: ٩٧-٩٨",
      benefit: 'إطفاء نيران الغضب وسكون النفس',
      categories: [.anger, .envy, .distress],
    ),
    DuaModel(
      dua:
          'اللهمَّ بعِلْمِكَ الغيبَ وقُدْرَتِكَ عَلَى الخلَقِ ، أحْيِني ما علِمْتَ الحياةَ خيرًا لِي ، وتَوَفَّنِي إذا عَلِمْتَ الوفَاةَ خيرًا لي ، اللهمَّ إِنَّي أسألُكَ خشْيَتَكَ في الغيبِ والشهادَةِ ، و أسأَلُكَ كَلِمَةَ الْحَقِّ فِي الرِّضَا والغضَبِ ، وأسألُكَ القصدَ في الفقرِ والغِنَى ، وأسألُكَ نعيمًا لَا ينفَدُ ، و أسالُكَ قرَّةَ عينٍ لا تنقَطِعُ ، وأسألُكَ الرِّضَى بعدَ القضاءِ ، وأسألُكَ برْدَ العيشِ بعدَ الموْتِ ، وأسألُكَ لذَّةَ النظرِ إلى وجهِكَ ، والشوْقَ إلى لقائِكَ في غيرِ ضراءَ مُضِرَّةٍ ، ولا فتنةٍ مُضِلَّةٍ ، اللهم زيِّنَّا بزينَةِ الإيمانِ ، واجعلنا هُداةً مهتدينَ',
      source: 'السنة النبوية',
      benefit:
          'عن السائب بن مالك قال: صلى بنا عمار بن ياسر رضي الله عنه صلاة فأوجز فقال له بعض القوم: لقد خففت أو أوجزت الصلاة فقال: أما على ذلك فقد دعوت فيها بدعوات سمعتهن من رسول الله صلى الله عليه وسلم فلما قام تبعه رجل من القوم فسأله عن الدعاء؟ فقال: اللهمَّ بعِلْمِكَ الغيبَ وقُدْرَتِكَ عَلَى الخلَقِ ، أحْيِني ما علِمْتَ الحياةَ خيرًا لِي ، وتَوَفَّنِي إذا عَلِمْتَ الوفَاةَ خيرًا لي ، اللهمَّ إِنَّي أسألُكَ خشْيَتَكَ في الغيبِ والشهادَةِ ، و أسأَلُكَ كَلِمَةَ الْحَقِّ فِي الرِّضَا والغضَبِ ، وأسألُكَ القصدَ في الفقرِ والغِنَى ، وأسألُكَ نعيمًا لَا ينفَدُ ، و أسالُكَ قرَّةَ عينٍ لا تنقَطِعُ ، وأسألُكَ الرِّضَى بعدَ القضاءِ ، وأسألُكَ برْدَ العيشِ بعدَ الموْتِ ، وأسألُكَ لذَّةَ النظرِ إلى وجهِكَ ، والشوْقَ إلى لقائِكَ في غيرِ ضراءَ مُضِرَّةٍ ، ولا فتنةٍ مُضِلَّةٍ ، اللهم زيِّنَّا بزينَةِ الإيمانِ ، واجعلنا هُداةً مهتدينَ. (الراوي عمار بن ياسر، أخرجه النسائي (1305)، وأحمد (18351) باختلاف يسير)',
      categories: [.anger],
    ),
    DuaModel(
      dua: 'اللهم لا تجعل في قلبي كراهية لأحد',
      source: '',
      benefit: '',
      categories: [.anger],
    ),
    DuaModel(
      dua:
          'اللهم طهر قلبي من كل سوء ، اللهم طهر قلبي من كل ما يبغضك، اللهم طهر قلبي من كل غلٍ وحقدٍ وحسد وكبر',
      source: '',
      benefit: '',
      categories: [.anger],
    ),
    DuaModel(
      dua:
          'ْاللهم إنِّي أَعُوْذُ بِكَ مِنْ هَمِّ يَحْزُنُنِي وَمِنْ فِكْرِ يُقْلِقُنِيْ وَعِلْمَا يُتْعِبُنِيْ وَشَخْصَا يَحْمِلُ خُبْثَا لِي',
      source: '',
      benefit: '',
      categories: [.anger],
    ),
    DuaModel(
      dua: 'اللَّهُمَّ أَذْهِبْ غَيْظَ قَلْبِي',
      source: '',
      benefit: '',
      categories: [.anger],
    ),

    //? ANXIETY
    DuaModel(
      dua:
          'حَسْبِيَ اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ عَلَيهِ تَوَكَّلتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ',
      source: 'السنة النبوية',
      benefit:
          'من قالها حين يصبح وحين يمسي سبع مرات كفاه اللَّه ما أهمّه من أمر الدنيا والآخرة',
      benefitSource:
          'عن أبي الدرداء رضي الله عنه أن النبي ﷺ قال: "مَن قال إذا أصبَحَ وإذا أمسَى: حَسبيَ اللهُ لا إلهَ إلَّا هو عليه تَوكَّلتُ وهو رَبُّ العَرشِ العَظيمِ، سَبعَ مرَّاتٍ، كَفاهُ اللهُ ما أهَمَّهُ صادِقًا كان بها أو كاذِبًا". (أخرجه ابن السني، برقم ٧١ مرفوعاً، وأبو داود موقوفاً، ٤/ ٣٢١، برقم ٥٠٨١)',
      categories: [.anxiety, .sadness, .confusion],
    ),
    DuaModel(
      dua: 'رَبِّ إِنِّيْ لِمَآ أَنْزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيْرٌ',
      source: "سورة القصص: ٢٤",
      benefit: '',
      categories: [.anxiety, .sadness, .confusion, .regret, .exhaustion],
    ),
    DuaModel(
      dua:
          'رَبِّ أَعُوْذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِيْنِ ، وَأَعُوذُ بِكَ رَبِّ أَنْ يَّحْضُرُوْنِ',
      source: "سورة المؤمنون: ٩٧-٩٨",
      benefit: '',
      categories: [.anxiety, .sadness],
    ),
    DuaModel(
      dua: '-رَبِّ- أَنِّيْ مَسَّنِيَ الضُّرُّ وَأَنْتَ أَرْحَمُ الرّٰحِمِيْن',
      source: "سورة الأنبياء: ٨٣",
      benefit: '',
      categories: [.anxiety, .sadness, .distress],
    ),
    DuaModel(
      dua: 'لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ',
      source: 'السنة النبوية',
      benefit:
          'كنز من كنوز الجنة وتعني اعتراف العبد بعجزه التام وافتقاره إلى الله عز وجل في دفع الشر وتحصيل الخير',
      benefitSource:
          'ألَا أدُلُّكَ على بابٍ مِنْ أبوابِ الجنَّةِ ؟ لَا حَوْلَ ولَا قوةَ إلَّا باللهِ. (الراوي : قيس بن سعد، أخرجه الترمذي (3581)، وأحمد (15480)، والنسائي في ((السنن الكبرى)) (10115) جميعا بلفظه مطولا)',
      categories: [.anxiety],
    ),
    DuaModel(
      dua:
          'اللَّهمَّ لا سَهلَ إلَّا ما جَعَلتَه سَهلًا، وأنتَ تَجعَلُ الحَزْنَ إذا شِئتَ سَهلًا',
      source: 'السنة النبوية',
      benefit:
          'دعاء تيسير الأمور المتعسرة، وهو مأثور عن النبي صلى الله عليه وسلم عند مواجهة أي أمر صعب',
      benefitSource:
          'عن أنس بن مالك، رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: ‌اللهم ‌لا ‌سهل إلا ما جعلته سهلا، وأنت تجعل الحزن إذا شئت سهلا. (أخرجه ابن حبان (974)، وابن السني في ((عمل اليوم والليلة)) (351))',
      categories: [.anxiety, .regret],
    ),
    DuaModel(
      dua:
          'لا إلَهَ إلَّا اللهُ العَظيمُ الحَليمُ، لا إلَهَ إلَّا اللهُ رَبُّ العَرشِ العَظيمِ، لا إلَهَ إلَّا اللهُ رَبُّ السَّمَواتِ ورَبُّ الأرضِ، ورَبُّ العَرشِ الكَريمِ',
      source: 'السنة النبوية',
      benefit:
          'واجبُ المسلِمِ إذا وقَعَ في كُربةٍ أو ضاقَتْ به الدُّنيا أنْ يَفزَعَ إلى اللهِ رَبِّه وإلهِه ومَوْلاه؛ فهو وَحْدَه القادِرُ على كَشْفِ الهَمِّ والغَمِّ، والدُّعاءُ مِن أسبابِ رَفْعِ البَلاءِ',
      benefitSource:
          'أنَّ رَسولَ اللهِ صلَّى اللهُ عليه وسلَّم كان يقولُ عِندَ الكَربِ: لا إلَهَ إلَّا اللهُ العَظيمُ الحَليمُ، لا إلَهَ إلَّا اللهُ رَبُّ العَرشِ العَظيمِ، لا إلَهَ إلَّا اللهُ رَبُّ السَّمَواتِ ورَبُّ الأرضِ، ورَبُّ العَرشِ الكَريمِ. (الراوي عبدالله بن عباس، المحدث البخاري، المصدر صحيح البخاري،أخرجه مسلم (2730) باختلاف يسير)',
      categories: [.anxiety, .sadness],
    ),
    DuaModel(
      dua: "حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلَُ",
      source: "سورة آل عمران: ١٧٣",
      benefit:
          'مِن صِدقِ الإيمانِ أنْ يَتيقَّنَ المؤمنُ أنَّ اللهَ هوَ كافِيه ما أهمَّه وألَمَّ بِه، وأنَّه نِعْمَ الكافي لِذلكَ، ويَتمثَّلُ هذا في القَولِ بِصِدقٍ: حَسبُنا اللَّهُ ونِعْمَ الوَكيلُ؛ فهوَ حَسبُنا وكافينا ونِعمَ المَولى ونِعمَ النَّصيرُ',
      benefitSource:
          'عَنِ ابنِ عَبَّاسٍ: حَسبُنا اللهُ ونِعمَ الوكيلُ، قالها إبراهيمُ عليه السَّلامُ حينَ أُلقيَ في النَّارِ، وقالها مُحَمَّدٌ صلَّى اللهُ عليه وسلَّم حينَ قالوا: {إنَّ النَّاسَ قد جَمَعوا لَكُم فاخشَوهم فزادَهم إيمانًا وقالوا حَسبُنا اللهُ ونِعمَ الوكيلُ} [آل عمران: 173]. (الراوي عبدالله بن عباس، المحدث البخاري، المصدر صحيح البخاري)',
      categories: [.anxiety, .sadness, .injustice, .distress],
    ),
    DuaModel(
      dua: 'لَا إِلٰهَ إِلَّا اللّٰهُ',
      source: 'السنة النبوية',
      benefit: '',
      benefitSource:
          'عَنْ زَيْنَبَ بِنْتِ جَحْشٍ رَضِيَ اللَّهُ عَنْها أنَّ النَّبيَّ صلَّى اللهُ عليه وسلَّم دَخَلَ عليها فزِعًا يقولُ: لا إلَهَ إلَّا اللهُ! ويلٌ للعَرَبِ مِن شَرٍّ قدِ اقتَرَبَ؛ فُتِحَ اليومَ مِن رَدمِ يَأجوجَ ومَأجوجَ مِثلُ هذه. وحَلَّقَ بإصبَعِه الإبهامِ والَّتي تَليها، قالت زَينَبُ بنتُ جَحشٍ: فقُلتُ: يا رَسولَ اللهِ، أنَهلِكُ وفينا الصَّالِحونَ؟ قال: نَعَم، إذا كَثُرَ الخَبَثُ. (الراوي زينب أم المؤمنين، المحدث البخاري، المصدر صحيح البخاري)',
      categories: [.anxiety],
    ),
    DuaModel(
      dua:
          'اَللّٰهُمَّ رَحْمَتَكَ أَرْجُوْ فَلَا تَكِلْنِيْ إِلٰى نَفْسِيْ طَرْفَةَ عَيْنٍ ، وَأَصْلِحْ لِي شَأْنِيْ كُلَّهُ لَا إِلٰهَ إِلَّا أَنْتَ',
      source: 'السنة النبوية',
      benefit: '',
      benefitSource:
          'قال النبي صلى الله عليه وسلم: "دعوات المكروب: اللهم رحمتك أرجو، فلا تكلني إلى نفسي طرفة عين، أصلح لي شأني كله، لا إله إلا أنت". (الراوي أبو بكرة نفيع بن الحارث، أخرجه أبو داود (5090))',
      categories: [.anxiety, .sadness],
    ),
    DuaModel(
      dua:
          'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَالْعَجْزِ وَالْكَسَلِ، وَالْبُخْلِ وَالْجُبْنِ، وَغَلَبَةِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ',
      source: 'السنة النبوية',
      benefit: '',
      benefitSource:
          'سمِعتُ رسولَ اللهِ صلَّى اللهُ عليه وسلَّم كثيرًا ما يَدْعو بهؤلاء الدَّعَواتِ: اللَّهمَّ إنِّي أَعوذُ بك مِنَ الهَمِّ والحَزَنِ، والعَجزِ والكسَلِ، والبُخلِ والجُبنِ، وضَلَعِ الدَّينِ، وغَلَبةِ الرِّجالِ. (الراوي أنس بن مالك، أخرجه البخاري (6369)، ومسلم (2706)، والترمذي (3484)، والنسائي (5453)، وأحمد (13304) واللفظ له)',
      categories: [
        .anxiety,
        .sadness,
        .distress,
        .exhaustion,
        .desire,
        .distress,
      ],
    ),
    DuaModel(
      dua:
          'اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ: فِي دِينِي وَدُنْيَايَ وَأَهْلِي، وَمَالِي، اللَّهُمَّ اسْتُرْ عَوْرَاتِي، وَآمِنْ رَوْعَاتِي، اللَّهُمَّ احْفَظْنِي مِنْ بَينِ يَدَيَّ، وَمِنْ خَلْفِي، وَعَنْ يَمِينِي، وَعَنْ شِمَالِي، وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي',
      source: 'السنة النبوية',
      benefit:
          'سؤال الله العفو والعافية في جميع شؤون العبد، وتحصين شامل بحفظ الله ورعايته للإنسان من جميع الجهات و الستر',
      benefitSource:
          '(الراوي عبدالله بن عمر، أخرجه أبو داود، وابن ماجه) لم يكن رسول الله صلى الله عليه وسلم يدع هؤلاء الدعوات، حين يمسي، وحين يصبح: ((اللهم إني أسألك العافية في الدنيا والآخرة، اللهم إني أسألك العفو والعافية في ديني ودنياي وأهلي ومالي، اللهم استر عورتي))، وقال عثمان: ((عوراتي وآمن روعاتي، اللهم احفظني من بين يدي، ومن خلفي، وعن يميني، وعن شمالي، ومن فوقي، وأعوذ بعظمتك أن أغتال من تحتي)) قال أبو داود: ((قال وكيع يعني الخسف))',
      categories: [.anxiety, .sadness],
    ),
    DuaModel(
      dua:
          'اللهمَّ إنِّي عبدُك، ابنُ عبدِك، ابنُ أمَتِك، ناصيتي بيدِك، ماضٍ فيَّ حُكمُك، عدلٌ فيَّ قضاؤُك، أسألُك اللهمَّ بكلِّ اسمٍ هو لك سمَّيتَ به نفسَك، أو أنزلته في كتابِك، أو علَّمته أحدًا مِن خلقِك، أو استأثرت به في علمِ الغيبِ عندَك، أن تجعلَ القرآنَ ربيعَ قلبِي، ونورَ صدرِي، وجلاءَ حزني، وذَهابَ همِّي',
      source: 'السنة النبوية',
      benefit: '',
      benefitSource:
          'عن عبد الله بن مسعود قال: قال رسول الله صلى الله عليه وسلم: (( ما أصاب أحدا قط هم ولا حزن، فقال: اللهم إني عبدك...، إلا أذهب الله همه وحزنه، وأبدله مكانه فرحا))، قال: فقيل: يا رسول الله، ألا نتعلمها؟ فقال: (( بلى، ينبغي لمن سمعها أن يتعلمها)). (أخرجه أحمد (3712)، وابن حبان (972))',
      categories: [.anxiety, .sadness],
    ),
    DuaModel(
      dua:
          'أعوذُ بكَلماتِ اللهِ التامَّاتِ من غَضَبِه وعِقابِه، ومن شَرِّ عِبادِه، ومن هَمَزاتِ الشياطينِ ، وأنْ يَحضُرونَ',
      source: 'السنة النبوية',
      benefit: 'عند الخوف و الفزع',
      benefitSource:
          'عن عبدالله بن عمرو أن رسول الله صلى الله عليه وسلم كان يعلمهم من الفزع كلمات: ((أعوذ بكلمات الله التامة، من غضبه وشر عباده، ومن همزات الشياطين وأن يحضرون)) وكان عبد الله بن عمر يعلمهن من عقل من بنيه، ومن لم يعقل كتبه فأعلقه عليه. (أخرجه بزيادة في أوله أبو داود (3893)، والترمذي (3528) باختلاف يسير)',
      categories: [.anxiety],
    ),
    DuaModel(
      dua: 'اللهم اجعلني أرى المواهب و نقاط قوت الذين وضعته في نفسي',
      source: '',
      benefit: '',
      benefitSource: '',
      categories: [.anxiety],
    ),
    DuaModel(
      dua: 'اللهم أنزِل عليّ سكينة من عندك تشرح بها صدري و تحفظُ بها قلبي',
      source: '',
      benefit: '',
      benefitSource: '',
      categories: [.anxiety],
    ),
    DuaModel(
      dua:
          'اللهم إليك أشكو ضعف قوتي وقلة حيلتي وهواني على الناس يا أرحم الراحمين أنت ربُّ المستضعفين وانت ربّي',
      source: '',
      benefit: '',
      benefitSource: '',
      categories: [.anxiety],
    ),

    //? SADNESS
    DuaModel(
      dua:
          'اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنْ ضِيْقِ الدُّنْيَا وَضِيْقِ يَوْمِ الْقِيَامَةِ',
      source: 'السنة النبوية',
      benefit: 'طلب الحماية والفرج والراحة النفسية والبدنية من الله عز وجل',
      benefitSource:
          'أنَّ رسولَ اللهِ صلى الله عليه وآله وسلم كان إذا هبَّ من الليلِ كبَّر عشرًا وحمِد عشرًا، وقال : سبحانَ الله وبحمدِه عشرًا، وقال : سبحانَ الملكِ القدُّوسِ عشرًا، واستغفر اللهَ عشرًا، وهلَّل عشرًا، ثمَّ قال : اللهمَّ إني أعوذُ بكَ من ضيقِ الدنيا وضيقِ يومِ القيامةِ عشرًا، ثمَّ يفتتحُ الصلاةَ. (الراوي عائشة أم المؤمنين، أخرجه أبو داود (5085) بلفظه، والنسائي (5535))',
      categories: [.sadness],
    ),
    DuaModel(
      dua:
          'بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ ،اَلْحَمْدُ لِلّٰهِ رَبِّ الْعَالَمِيْنَ ، الرَّحْمٰنِ الرَّحِيْمِ ، مٰلِكِ يَوْمِ الدِّيْنِ ، إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِيْنُ ، اِهْدِنَا الصِّرَاطَ الْمُسْتَقِيْمَ ، صِرَاطَ الَّذِيْنَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوْبِ عَلَيْهِمْ وَلَا الضَّآلِّيْنَ',
      source: 'سورة الفاتحة',
      benefit: '',
      categories: [.sadness, .confusion],
    ),
    DuaModel(
      dua:
          'يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغيثُ أَصْلِحْ لِي شَأْنِيَ كُلَّهُ وَلاَ تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ',
      source: 'السنة النبوية',
      benefit: 'تفويض الأمر لله وحفظ النفس من الضياع وتيسير كل أمور الحياة',
      benefitSource: '(الحاكم وصححه، ووافقه الذهبي، ١/ ٥٤٥)',
      categories: [.sadness, .confusion, .exhaustion],
    ),
    DuaModel(
      dua:
          'اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنْ جَهْدِ الْبَلَاءِ ، وَدَرَكِ الشَّقَاءِ ، وَسُوْءِ الْقَضَاءِ ، وَشَمَاتَةِ الْأَعْدَاءِ',
      source: 'السنة النبوية',
      benefit: '',
      benefitSource:
          'عَنْ أَبي هُريَرةَ رضي الله عنه، عن النَّبِيِّ ﷺ قَالَ: ((تَعَوَّذُوا بِاللَّهِ مِنْ جَهْدِ الْبَلاءِ، وَدَرَكِ الشَّقَاءِ، وَسُوءِ الْقَضَاءِ، وَشَماتَةِ الأَعْدَاءِ)). (أخرجه البخاري (6347)، ومسلم (2707)، والنسائي (5492)، وأحمد (7355))',
      categories: [.sadness],
    ),
    DuaModel(
      dua:
          'إِنَّا لِلّٰهِ وَإِنَّا إِلَيْهِ رَاجِعُوْنَ ، اَللّٰهُمَّ أْجُرْنِيْ فِيْ مُصِيْبَتِيْ ، وَأَخْلِفْ لِيْ خَيْرًا مِنْهَا',
      source: 'السنة النبوية',
      benefit:
          'ما مِن مُسلِمٍ تُصيبُه مُصيبةٌ، فيَقولُ ما أمَرَه اللهُ، إلَّا أخلَفَ اللهُ له خَيرًا مِنها',
      benefitSource:
          'عن أم سلمة؛ أنها قالت: سمعت رسول الله صلى الله عليه وسلم يقول "ما مِن مُسلِمٍ تُصيبُه مُصيبةٌ، فيَقولُ ما أمَرَه اللهُ: {إنَّا للَّهِ وإنَّا إليه راجِعونَ} [البقرة: 156]، اللهمَّ أْجُرني في مُصيبَتي، وأخلِفْ لي خَيرًا مِنها، إلَّا أخلَفَ اللهُ له خَيرًا مِنها"، قالت: فلَمَّا ماتَ أبو سَلَمةَ قُلتُ: أيُّ المُسلِمينَ خَيرٌ مِن أبي سَلَمةَ؟ أوَّلُ بَيتٍ هاجَرَ إلى رَسولِ اللهِ صلَّى اللهُ عليه وسلَّم، ثُمَّ إنِّي قُلتُها، فأخلَفَ اللهُ لي رَسولَ اللهِ صلَّى اللهُ عليه وسلَّم، قالت: أرسَلَ إلَيَّ رَسولُ اللهِ صلَّى اللهُ عليه وسلَّم حاطِبَ بنَ أبي بَلتَعةَ يَخطُبُني له، فقُلتُ: إنَّ لي بنتًا، وأنا غَيورٌ، فقال: أمَّا ابنَتُها فنَدعو اللهَ أن يُغنيَها عَنها، وأدعو اللهَ أن يَذهَبَ بالغَيرةِ. (صحيح مسلم)',
      categories: [.sadness],
    ),
    DuaModel(
      dua:
          'اللهمّ إنّي ظلمت نفسي ظلماً كثيراً، ولا يغفر الذّنوب إلا أنت فاغفر لي مغفرة من عندك، وارحمني إنّك أنت الغفور الرّحيم',
      source: '',
      benefit: '',
      categories: [.sadness],
    ),
    DuaModel(
      dua:
          'اللهم إليك أشكو ضعف قوتي وقلة حيلتي وهواني على الناس يا أرحم الراحمين أنت ربُّ المستضعفين وانت ربّي',
      source: '',
      benefit: '',
      categories: [.sadness],
    ),

    //? CONFUSION
    DuaModel(
      dua:
          'اللَّهمَّ أحسِن عاقبتَنا في الأمورِ كُلِّها وأجِرنا مِنَ خزيِ الدُّنيا وعذابِ الآخرةِ',
      source: 'السنة النبوية',
      benefit: '',
      benefitSource:
          'عن بسر بن أرطاة القرشي رَضيَ اللهُ عنه، قال: سمعت رسول الله صلى الله عليه وسلم يدعو: "اللَّهمَّ أحسِن عاقبتَنا في الأمورِ كُلِّها وأجِرنا مِنَ خزيِ الدُّنيا وعذابِ الآخرةِ". (أخرجه أحمد (17628)، والبخاري في ((التاريخ الكبير)) (1/30))',
      categories: [.confusion],
    ),
    DuaModel(
      dua:
          'اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ الثَّبَاتَ فِي الْأَمْرِ ، وَالْعَزِيْمَةَ عَلَى الرُّشْدِ ، وَأَسْأَلُكَ مُوْجِبَاتِ رَحْمَتِكَ ، وَعَزَائِمَ مَغْفِرَتِكَ ، وَأَسْأَلُكَ شُكْرَ نِعْمَتِكَ ، وَحُسْنَ عِبَادَتِكَ ، وَأَسْأَلُكَ قَلْبًا سَلِيْمًا ، وَلِسَانًا صَادِقًا ، وَأَسْأَلُكَ مِنْ خَيْرِ مَا تَعْلَمُ ، وَأَعُوْذُ بِكَ مِنْ شَرِّ مَا تَعْلَمُ ، وَأَسْتَغْفِرُكَ لِمَا تَعْلَمُ ، إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوْبِ',
      source: 'السنة النبوية',
      benefit: '',
      benefitSource:
          'يا شدَّادُ بنُ أوسٍ ! إذا رأيتَ النَّاسَ قد اكتنزوا الذَّهبَ والفضَّةَ؛ فاكنِز هؤلاء الكلماتِ : اللَّهمَّ ! إنِّي أسألُك الثَّباتَ في الأمرِ ، والعزيمةَ على الرُّشدِ ، وأسألُك موجِباتِ رحمتِك ، وعزائمَ مغفرتِك ، وأسألُك شُكرَ نعمتِك، وحُسنَ عبادتِك، وأسألُك قلبًا سليمًا، ولسانًا صادقًا، وأسألُك من خيرِ ما تعلَمُ، وأعوذُ بك من شرِّ ما تعلَمُ، وأستغفرُك لما تعلَمُ؛ إنَّك أنت علَّامُ الغيوبِ. (الراوي شداد بن أوس، أخرجه الطبراني (7/ 279) (7135) واللفظ له، وأبو نعيم في ((حلية الأولياء)) (1/ 266) والحاكم (1872) باختلاف يسير)',
      categories: [.confusion],
    ),
    DuaModel(
      dua:
          'اللهمَّ إنِّي أسألُك من الخيرِ كلِّه عاجلِه وآجلِه ما علِمتُ منه وما لم أعلمُ ، وأعوذُ بك من الشرِّ كلِّه عاجلِه وآجلِه ما علِمتُ منه وما لم أعلمُ . اللهمَّ إنِّي أسألُك من خيرِ ما سألَك به عبدُك ونبيُّك ، وأعوذُ بك من شرِّ ما عاذ به عبدُك ونبيُّك . اللهمَّ إنِّي أسألُك الجنةَ وما قرَّب إليها من قولٍ أو عملٍ ، وأعوذُ بك من النارِ وما قرَّب إليها من قولٍ أو عملٍ ، وأسألُك أنْ تجعلَ كلَّ قضاءٍ قضيتَه لي خيرًا',
      source: 'السنة النبوية',
      benefit: '',
      benefitSource:
          'عن عائشةُ رَضي اللهُ عنها، أنَّ رسولَ اللهِ صلَّى اللهُ علَيه وسلَّم علَّمها هذا الدُّعاءَ: "اللَّهمَّ إنِّي أسألُك..". (أخرجه مسلم (2716) مختصراً)',
      categories: [.confusion],
    ),
    DuaModel(
      dua:
          'اللَّهمَّ ربَّ جبريلَ وميكائيلَ وإسرافيلَ فاطرَ السَّمواتِ والأرضِ عالِمَ الغيبِ والشَّهادةِ أنتَ تحكُمُ بينَ عبادِكَ فيما كانوا فيهِ يختلِفونَ اهدِني لما اختُلِفَ فيهِ منَ الحقِّ بإذنِكَ إنَّكَ تهدي من تشاءُ إلى صِراطٍ مستقيمٍ',
      source: 'السنة النبوية',
      benefit: '',
      benefitSource:
          'عن أبي سَلَمةَ بنِ عبدِ الرَّحمَنِ بنِ عَوفٍ، قال: سَألتُ عائِشةَ أُمَّ المُؤمِنينَ: بأيِّ شَيءٍ كان نَبيُّ اللهِ صلَّى اللهُ عليه وسلَّم يَفتَتِحُ صَلاتَه إذا قامَ مِنَ اللَّيلِ؟ قالت: كان إذا قامَ مِنَ اللَّيلِ افتَتَحَ صَلاتَه: "اللَّهُمَّ رَبَّ جِبرائيلَ..". (أخرجه أبو داود (767)، والترمذي (3420)، والنسائي (1625)، وابن ماجه (1357) جميعا باختلاف يسير)',
      categories: [.confusion],
    ),
    DuaModel(
      dua:
          'اَللّٰهُمَّ اهْدِنِيْ وَسَدِّدْنِيْ ، اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ الْهُدَىٰ وَالسَّدَادَ',
      source: 'السنة النبوية',
      benefit: '',
      benefitSource:
          'عن علي بن أبي طالب (رضي الله عنه)، قال لي رَسولُ اللهِ صلَّى اللهُ عليه وسلَّم: قُلِ: اللَّهمَّ اهدِني وسَدِّدْني، واذكُرْ بالهُدى هِدايَتَكَ الطَّريقَ، والسَّدادِ سَدادَ السَّهمِ. [وفي روايةٍ]: "قُلِ: اللَّهمَّ إنِّي أسألُكَ الهُدى والسَّدادَ..". (أخرجه أحمد (664) واللفظ له، وأبو داود (4225) بلفظ مقارب)',
      categories: [.confusion],
    ),
    DuaModel(
      dua: 'يا مقلِّبَ القلوبِ ثبِّت قلبي على دينِكَ',
      source: 'السنة النبوية',
      benefit: '',
      benefitSource:
          'كانَ رسولُ اللَّهِ صلَّى اللَّهُ عليْهِ وسلَّمَ يُكثِرُ أن يقولَ: يا مقلِّبَ القلوبِ ثبِّت قلبي على دينِكَ فقلتُ: يا نبيَّ اللَّهِ آمنَّا بِكَ وبما جئتَ بِهِ فَهل تخافُ علَينا ؟ قالَ: نعَم إنَّ القلوبَ بينَ إصبَعَينِ من أصابعِ اللَّهِ يقلِّبُها كيفَ شاءَ. (الراوي أنس بن مالك، أخرجه الترمذي (2140) واللفظ له، وأحمد (13696) باختلاف يسير، وابن ماجه (3834) بنحوه)',
      categories: [.confusion, .regret],
    ),
    DuaModel(
      dua: 'اللَّهمَّ قِني شرَّ نفسي واعزِمْ لي على أرشَدِ أمري',
      source: 'السنة النبوية',
      benefit: '',
      benefitSource:
          'عن عمرانَ بنِ حُصينٍ عن أبيه أنَّه أتَى النَّبيَّ صلَّى اللهُ عليه وآلِه وسلَّم فقال : يا محمَّدُ كان عبدُ المطَّلبِ خيرًا لقومِك منك … الحديثُ وفيه : فلمَّا أراد أن ينصرِفَ قال : ما أقولُ ؟ قال : قُلِ اللَّهمَّ قِني شرَّ نفسي واعزِمْ لي على أرشَدِ أمري، فانطلق ولم يكُنْ أسلم ثمَّ أسلم فقال : يا رسولَ اللهِ فما أقولُ الآن حين أسلمتُ، قال : قُلِ اللَّهمَّ قني شرَّ نفسي واعزِمْ لي أرشَدَ أمري اللَّهمَّ اغفِرْ لي ما أسررتُ وما أعلنتُ وما أخطأتُ وما عمِدتُ وما علِمتُ وما جهِلتُ. وفي روايةٍ للنَّسائيِّ : فما أقولُ الآن وأنا مسلمٌ. (أخرجه ابن سعد في ((الطبقات)) (5/ 190)، والترمذي في ((العلل الكبير)) (678))',
      categories: [.confusion],
    ),
    DuaModel(
      dua:
          'اللهم إن كان هذا الأمر خيرا لي فَاقْدُرْهُ لِي وَيَسِّرْهُ لِي ثُمَّ بَارِكْ لِي فِيهِ',
      source: 'السنة النبوية',
      benefit: 'جزء من دعاء الاستخارة',
      categories: [.confusion],
    ),
    DuaModel(
      dua: 'اَللّٰهُمَّ جَدِّدِ الْإِيْمَانَ فِيْ قَلْبِيْ',
      source: 'السنة النبوية',
      benefit: '',
      benefitSource:
          'إنَّ الإيمانَ ليَخلَقُ في جوفِ أحدِكم كما يَخْلَقُ الثوبُ ، فاسأَلوا اللهَ أن يُجدِّدَ الإيمانَ في قلوبِكم. (الراوي عبدالله بن عمرو، أخرجه الطبراني (14/70) (14668)، والحاكم (5))',
      categories: [.confusion],
    ),
    DuaModel(
      dua: 'يا ولِيَّ الإسلامِ وأهلِهِ، مسِّكْنِي بالإسلامِ حتى ألقاكَ عليْهِ',
      source: 'السنة النبوية',
      benefit: '',
      benefitSource:
          'عن أنس بن مالك رضي الله عنه، أن رسول الله صلى الله عليه وسلم كان يقول: يا ولي الإسلام وأهله، ثبتني به حتى ألقاك. (أخرجه الطبراني في ((المعجم الأوسط)) (661)، والدارقطني في ((المؤتلف والمختلف)))',
      categories: [.confusion],
    ),
    DuaModel(
      dua: 'اللهم املأ قلبى بحبك',
      source: '',
      benefit: '',
      categories: [.confusion],
    ),

    //? REGRET
    DuaModel(
      dua:
          'لَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ',
      source: "سورة الأنبياء: ٨٧",
      benefit: '',
      categories: [.regret, .distress],
    ),
    DuaModel(
      dua: 'رَبِّ إِنِّيْ ظَلَمْتُ نَفْسِيْ فَاغْفِرْ لِيْ',
      source: 'سورة القصص: ١٦',
      benefit: '',
      categories: [.regret],
    ),
    DuaModel(
      dua:
          'رَبَّنَا ظَلَمْنَآ أَنْفُسَنَا وَإِنْ لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُوْنَنَّ مِنَ الْخٰسِرِيْنَ',
      source: "سورة الأعراف: ٢٣",
      benefit: '',
      categories: [.regret],
    ),
    DuaModel(
      dua:
          'أَنْتَ وَلِيُّنَا فَاغْفِرْ لَنَا وَارْحَمْنَا ۖ وَأَنْتَ خَيْرُ الْغَافِرِيْنَ',
      source: "سورة الأعراف: ١٥٥",
      benefit: '',
      categories: [.regret],
    ),
    DuaModel(
      dua:
          'اللهمَّ اغفِرْ لي خطيئَتي وجَهلي ، وإسرافي في أمري ، وما أنت أعلمُ به مني ، اللهمَّ اغفرْ لي خطَئي وعَمْدي ، وهَزْلي وجِدِّي ، وكلُّ ذلك عندي ، اللهمَّ اغفرْ لي ما قدَّمتُ وما أخَّرتُ ، وما أسررتُ وما أعلنتُ ، أنت المقدِّمُ وأنت المؤخِّرُ ، وأنت على كلِّ شيء قديرٌ',
      source: 'السنة النبوية',
      benefit: "",
      benefitSource:
          'عن أبي بكر بن أبي موسى وأبي بردة أحسبه عن أبي موسى الأشعري عن النبي صلى الله عليه وسلم أنه كان يدعو: "اللهم اغفر لي خطيئتي وجهلي، وإسرافي في أمري، وما أنت أعلم به مني، اللهم اغفر لي هزلي وجدي، وخطاي وعمدي، وكل ذلك عندي". (أخرجه البخاري (6399)، ومسلم (2719) باختلاف يسير)',
      categories: [.regret],
    ),
    DuaModel(
      dua:
          'رَبَّنَآ إِنَّنَآ اٰمَنَّا فَاغْفِرْ لَنَا ذُنُوْبَنَا وَقِنَا عَذَابَ النَّارِ',
      source: 'سورة آل عمران: ١٦',
      benefit: '',
      categories: [.regret],
    ),
    DuaModel(
      dua:
          'رَبَّنَآ اٰمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنْتَ خَيْرُ الرّٰحِمِيْنَ',
      source: 'سورة المؤمنون: ١٠٩',
      benefit: '',
      categories: [.regret],
    ),
    DuaModel(
      dua: 'رَبِّ اغْفِرْ وَارْحَمْ وَأَنْتَ خَيْرُ الرّٰحِمِيْنَ',
      source: 'سورة المؤمنون: ١١٨',
      benefit: '',
      categories: [.regret],
    ),
    DuaModel(
      dua: 'آمَنْتُ بِاللهِ وَرُسُلِهِ',
      source: 'السنة النبوية',
      benefit: '',
      benefitSource:
          'يأتي الشيطانُ الإنسانَ فيقولُ من خلق السمواتِ فيقولُ اللهُ فيقولُ من خلق الأرَضِينَ فيقولُ اللهُ حتى يقولَ من خلق اللهَ فإذا وجد أحدُكم ذلك فَلْيَقُلْ آمنتُ باللهِ ورسولِه. (الراوي خزيمة بن ثابت، أخرجه أحمد (21867)، وابن أبي عاصم في ((السنة)) (650))',
      categories: [.regret],
    ),
    DuaModel(
      dua:
          'هُوَ الْأَوَّلُ وَالْآخِرُ وَالظَّاهِرُ وَالْبَاطِنُ ۖ وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ',
      source: "سورة الحديد: ٣",
      benefit: '',
      categories: [.regret],
    ),
    DuaModel(
      dua:
          'اللهمَّ إني أعوذُ بك أنْ أُشرِكَ بك وأنا أعلمُ، و أستغفرُك لما لا أعلمُ',
      source: 'السنة النبوية',
      benefit: '',
      benefitSource:
          'عن أبو بكر الصديق (رضي الله عنه)، قال رسول الله صلى الله عليه وسلم ‌"الشرك ‌أخفى في أمتي من دبيب النمل على الصفا" قال أبو بكر فقلت يا رسول الله بأبي أنت وأمي فما المخرج من ذلك فقال النبي صلى الله عليه وسلم "يا أبا بكر ألا أعلمك شيئا إذا قلته برئت من قليله وكثيره قل اللهم إني أعوذ بك أن أشرك بك وأنا أعلم وأستغفرك مما لا أعلم". (أخرجه أبو يعلى (60 )، وابن حبان في ((المجروحين)) (3/ 130))',
      categories: [.regret],
    ),
    DuaModel(
      dua:
          'اَللّٰهُمَّ عَافِنِيْ فِيْ بَدَنِيْ ، اَللّٰهُمَّ عَافِنِيْ فِيْ سَمْعِيْ ، اَللّٰهُمَّ عَافِنِيْ فِيْ بَصَرِيْ ، لَا إِلٰهَ إِلَّا أَنْتَ ، اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ، وأَعُوْذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لَا إِلٰهَ إِلَّا أَنْتَ',
      source: 'السنة النبوية',
      benefit: '',
      benefitSource:
          'قال عبدالرحمن بن أبي بكرة يا أَبتِ، إنِّي أَسمَعُك تَدْعو كلَّ غَداةٍ: اللَّهمَّ عافِني في بَدَني، اللَّهمَّ عافِني في سَمْعي، اللَّهمَّ عافِني في بَصَري، لا إلهَ إلَّا أنتَ؛ تُعيدُها ثلاثًا حينَ تُصبِحُ، وثَلاثًا حينَ تُمسي؟ فَقال: إنِّي سَمِعتُ رَسولَ اللهِ صلَّى اللهُ عليهِ وسلَّم يَدْعو بِهنَّ، فأَنا أُحِبُّ أن أَستَنَّ بِسُنَّتِه . قال عبَّاسٌ فيهِ: وتَقولُ: اللَّهمَّ إنِّي أَعوذُ بكَ منَ الكُفرِ والفَقرِ، اللَّهمَّ إنِّي أَعوذُ بِكَ مِن عَذابِ القَبرِ، لا إلهَ إلَّا أنتَ، تُعيدُها ثَلاثًا حينَ تُصبِح، وثَلاثًا حينَ تُمسي، فتَدْعو بهِنَّ، فأُحِبُّ أن أَستَنَّ بِسُنَّتِه. (الراوي أبو بكرة نفيع بن الحارث، أخرجه أبو داود (5090)، وأحمد (20430) والنسائي في ((السنن الكبرى)) (9766) جميعا بلفظه مطولا)',
      categories: [.regret, .exhaustion],
    ),

    //? EXHAUSTION
    DuaModel(
      dua:
          'اللَّهمَّ إنِّي أعوذُ بِكَ منَ البُخلِ، وأعوذُ بِكَ منَ الجُبنِ، وأعوذُ بِكَ أن أُرَدَّ إلى أرذلِ العمرِ، وأعوذُ بِكَ مِن فتنةِ الدُّنيا، وأعوذُ بِكَ مِن عذابِ القبرِ',
      source: 'السنة النبوية',
      benefit: '',
      benefitSource:
          'كان النَّبيُّ صلَّى اللهُ عليه وسلَّم يُعَلِّمُنا هؤلاء الكَلِماتِ كما تُعَلَّمُ الكِتابةُ: "اللهُمَّ إنِّي أعوذُ بكَ مِنَ البُخلِ..". (الراوي سعد بن أبي وقاص، أخرجه ابن حبان (1763) واللفظ له، والترمذي (3567))',
      categories: [.exhaustion],
    ),
    DuaModel(
      dua:
          'اَللّٰهُمَّ مُصَرِّفَ الْقُلُوْبِ صَرِّفْ قُلُوْبَنَا عَلَىٰ طَاعَتِكَ',
      source: 'السنة النبوية',
      benefit: '',
      benefitSource:
          'إنَّ قُلوبَ بَني آدَمَ كُلَّها بينَ إصبَعَينِ مِن أصابِعِ الرَّحمَنِ، كَقَلبٍ واحِدٍ، يُصَرِّفُه حَيثُ يَشاءُ، ثُمَّ قال رَسولُ اللهِ صلَّى اللهُ عليه وسلَّم: اللَّهمَّ مُصَرِّفَ القُلوبِ، صَرِّفْ قُلوبَنا على طاعَتِكَ. (الراوي عبدالله بن عمرو، أخرجه مسلم (2654) باختلاف يسير)',
      categories: [.exhaustion],
    ),
    DuaModel(
      dua: 'اللهمَّ أعنِّي على ذكرِك وشكرِك وحسنِ عبادَتِك',
      source: 'السنة النبوية',
      benefit: '',
      benefitSource:
          'أنَّ رسولَ اللَّه صلَّى اللَّه علَيهِ وسلَّمَ أخذَ بيدِهِ، وقالَ: يا مُعاذُ، واللَّهِ إنِّي لأحبُّكَ، واللَّهِ إنِّي لأحبُّك، فقالَ: أوصيكَ يا معاذُ لا تدَعنَّ في دُبُرِ كلِّ صلاةٍ تقولُ: اللَّهمَّ أعنِّي على ذِكْرِكَ، وشُكْرِكَ، وحُسنِ عبادتِكَ. (الراوي معاذ بن جبل، أخرجه أبو داود (1522)، والنسائي (1303))',
      categories: [.exhaustion],
    ),
    DuaModel(
      dua:
          'اللَّهمَّ إنِّي أسالُك فِعلَ الخيراتِ وتركَ المنكراتِ وحبَّ المساكينِ وأن تغفرَ لي وترحَمَني وإذا أردتَ فتنةً في قومٍ فتوفَّني غيرَ مفتونٍ وأسالك حبَّكَ وحبَّ من يحبُّكَ وحبَّ عملٍ يقرِّبُني إلى حُبِّكَ',
      source: 'السنة النبوية',
      benefit: '',
      benefitSource:
          'احتُبِسَ عنا رسولُ اللَّهِ صلَّى اللَّهُ عليهِ وسلَّمَ ذاتَ غداةٍ في صلاةِ الصُّبحِ حتَّى كِدنا نتراءى قرنَ الشَّمسِ ، فخرجَ رسولُ اللَّهِ صلَّى اللَّهُ عليهِ وسلَّمَ سريعًا فثوِّبَ بالصَّلاةِ وصلَّى وتجوَّزَ في صلاتِهِ ، فلمَّا سلَّمَ. قالَ : كما أنتُمْ علَى مصافِّكم . ثمَّ أقبلَ إلَينا. فقالَ : إنِّي سأحدِّثُكُم ما حبسَني عنكمُ الغداةَ إنِّي قمتُ منَ اللَّيلِ فصلَّيتُ ما قُدِّرَ لي فنعستُ في صلاتي حتَّى استثقلت ، فإذا أنا بربِّي عزَّ وجلَّ في أحسنِ صورةٍ. فقالَ : يا محمَّدُ فيمَ يختصمُ الملأُ الأعلى ؟ قلتُ : لا أدري ربِّ. قالَ يا محمَّدُ فيمَ يختصمُ الملأُ الأعلى ؟ قلتُ : لا أدري ربِّ فرأيتُهُ وضعَ كفَّهُ بينَ كتفيَّ حتَّى وجدتُ بَردَ أناملِهِ في صدري وتجلَّى لي كلُّ شيءٍ وعرَفتُ ، فقالَ : يا محمَّدُ فيمَ يختصمُ الملأُ الأعلى ؟ قلتُ : في الكفَّاراتِ والدَّرجاتِ. قالَ : وما الكفَّاراتُ ؟ قُلتُ : نقلُ الأقدامِ إلى الجمُعاتِ والجلوسُ في المساجدِ بعدَ الصَّلواتِ وإسباغُ الوضوءِ علَى الكَريهاتِ. فقالَ : وما الدَّرجاتُ ؟ قلتُ : إطعامُ الطَّعامِ ولينُ الكلامِ والصَّلاةُ والنَّاسُ نيامٌ. قالَ سَلْ. قلتُ : اللَّهمَّ إنِّي أسالُك فِعلَ الخيراتِ وتركَ المنكراتِ وحبَّ المساكينِ وأن تغفرَ لي وترحَمَني وإذا أردتَ فتنةً في قومٍ فتوفَّني غيرَ مفتونٍ وأسالك حبَّكَ وحبَّ من يحبُّكَ وحبَّ عملٍ يقرِّبُني إلى حُبِّكَ . وقالَ رسولُ اللَّهِ صلَّى اللَّهُ عليهِ وسلَّمَ : إنَّها حقٌّ فادرُسوها وتعلَّموها. (الراوي معاذ بن جبل، أخرجه الترمذي (3235)، وأحمد (22162) باختلاف يسير)',
      categories: [.exhaustion],
    ),

    //? DESIRE
    DuaModel(
      dua: 'اللهم اطفئ نار الشهوات من قلبى ، واصرف عنه كل شئ لا يرضيك عنى',
      source: '',
      benefit: '',
      categories: [.desire],
    ),
    DuaModel(
      dua: 'اللهم غض بصرى و حصن فرجى و طهر قلبى',
      source: '',
      benefit: '',
      categories: [.desire],
    ),
    DuaModel(
      dua:
          'اللَّهُمَّ قنِّعْني بما رَزَقْتني، وبارِكْ لي فيه، واخلُفْ عليَّ كُلِّ غائبةٍ لي بخيرٍ',
      source: 'السنة النبوية',
      benefit: '',
      benefitSource:
          'كان النَّبيُّ صلَّى اللهُ عليه وسلَّمَ يَدْعو يقولُ: اللَّهُمَّ قنِّعْني بما رَزَقْتني، وبارِكْ لي فيه، واخلُفْ عليَّ كُلِّ غائبةٍ لي بخيرٍ. (الراوي عبدالله بن عباس،  أخرجه البيهقي في ((الدعوات الكبير)) (242)، ابن السني في ((القناعة)) (11) واللفظ لهم)',
      categories: [.desire],
    ),
    DuaModel(
      dua: 'يا صبور صبّرني على ما بلوتني وامتحنتني',
      source: '',
      benefit: '',
      categories: [.desire, .envy],
    ),
    DuaModel(
      dua:
          'أعوذُ بك من شرِّ سمعِي وشرِّ بصرِي وشرِّ لساني وشرِّ قلبي وشرِّ منيِّي',
      source: 'السنة النبوية',
      benefit: '',
      benefitSource:
          'أتيتُ النَّبيَّ صلَّى اللَّهُ عليهِ وسلَّمَ فقُلتُ: يا رسولَ اللَّهِ علِّمني تَعوُّذًا أتعوَّذُ بِهِ. قالَ: فأخذَ بكفي فقالَ: "قُل اللَّهمَّ إنِّي أعوذُ بِكَ مِن شرِّ سمعي، ومِن شرِّ بصَري، ومِن شرِّ لِساني، ومِن شرِّ قلبي، ومن شرِّ مَنيِّي (يَعني فرجَهُ)". (الراوي شكل بن حميد العبسي، أخرجه أبو داود (1551)، والترمذي (3492)، والنسائي (5444))',
      categories: [.desire],
    ),

    //? ENVY
    //TODO Check other supplications for these sub-cat: // Envious, Jealous, Spiteful, Covetous, Evil Eye, Malice, Heart Purification
    DuaModel(
      dua:
          'اللهم طهر قلبي من كل سوء ، اللهم طهر قلبي من كل ما يبغضك، اللهم طهر قلبي من كل غلٍ وحقدٍ وحسد وكبر',
      source: '',
      benefit: '',
      categories: [.envy],
    ),

    //? CONTENTMENT
    DuaModel(
      dua:
          'اللهمَّ إنَّي أعوذُ بك من زوالِ نعمَتِك ، و تَحَوُّلِ عافيَتِك ، و فجْأةِ نقمتِك ، و جميعِ سَخَطِك',
      source: 'السنة النبوية',
      benefit: '',
      benefitSource:
          'كانَ مِن دُعاءِ رَسولِ اللهِ صلَّى اللهُ عليه وسلَّم: اللَّهمَّ إنِّي أعوذُ بكَ مِن زَوالِ نِعمَتِكَ، وتَحَوُّلِ عافيَتِكَ، وفُجاءةِ نِقمَتِكَ، وجَميعِ سَخَطِكَ. (الراوي عبدالله بن عمر، أخرجه مسلم (2739))',
      categories: [.contentment],
    ),
    DuaModel(
      dua:
          'رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَدْخِلْنِي بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِينَ',
      source: 'سورة النمل: ١٩',
      benefit: '',
      benefitSource:
          'فَتَبَسَّمَ ضَاحِكًا مِّن قَوْلِهَا وَقَالَ رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَدْخِلْنِي بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِينَ (19)',
      categories: [.contentment],
    ),
    DuaModel(
      dua:
          '-اَللّٰهُمَّ يَا- فَاطِرَ السَّمٰوَاتِ وَالْأَرْضِ ، أَنْتَ وَلِـيِّيْ فِي الدُّنْيَا وَالْآخِرَةِ ، تَوَفَّنِيْ مُسْلِمًا وَّأَلْحِقْنِيْ بِالصَّالِحِيْنَ',
      source: "سورة يوسف: ١٠١",
      benefit:
          'هذا دعاء من يوسف الصديق ، دعا به ربه عز وجل ، لما تمت النعمة عليه ، باجتماعه بأبويه وإخوته ، وما من الله به عليه من النبوة والملك ، سأل ربه عز وجل ، كما أتم نعمته عليه في الدنيا أن يستمر بها عليه في الآخرة ، وأن يتوفاه مسلما حين يتوفاه',
      benefitSource:
          'رَبِّ قَدْ آتَيْتَنِي مِنَ الْمُلْكِ وَعَلَّمْتَنِي مِن تَأْوِيلِ الْأَحَادِيثِ ۚ فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ أَنتَ وَلِيِّي فِي الدُّنْيَا وَالْآخِرَةِ ۖ تَوَفَّنِي مُسْلِمًا وَأَلْحِقْنِي بِالصَّالِحِينَ (101)',
      categories: [.contentment],
    ),
    DuaModel(
      dua: 'الحمدُ للَّهِ الَّذي بنعمتِه تتمُّ الصَّالحاتُ',
      source: 'السنة النبوية',
      benefit:
          'المؤمِنُ الحقُّ يَشكُرُ اللهَ على كلِّ حالٍ في السَّرَّاءِ والضَّرَّاءِ، وقد علَّمَنا النَّبيُّ صلَّى اللهُ علَيه وسلَّم ما نَقولُه عندَ رُؤيةِ ما نُحِبُّه أو نَكرَهُه',
      benefitSource:
          'كانَ رسولُ اللَّهِ صلَّى اللَّهُ عليهِ وسلَّمَ إذا رأى ما يُحبُّ قالَ الحمدُ للَّهِ الَّذي بنِعمتِهِ تتمُّ الصَّالحاتُ وإذا رأى ما يكرَهُ قالَ الحمدُ للَّهِ علَى كلِّ حالٍ. (الراوي عائشة أم المؤمنين، أخرجه ابن ماجه (3803)، وابن السني في ((عمل اليوم والليلة)) (378) واللفظ لهما)',
      categories: [.contentment],
    ),
    DuaModel(
      dua:
          'اللَّهُمَّ مَا أَصْبَحَ (مَا أَمْسَىٰ) بِي مِنْ نِعْمَةٍ أَوْ بِأَحَدٍ مِنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ لاَ شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ',
      source: 'السنة النبوية',
      benefit:
          'من قالها حين يصبح فقد أدَّى شكر يومه، ومن قالها حين يمسي فقد أدَّى شكر ليلته',
      benefitSource:
          'حديث عبد الله بن غنام البياضي رضي الله عنه، أن النبي ﷺ قال: "مَن قال حينَ يُصبِحُ: اللَّهمَّ ما أصبَح بي مِن نِعمةٍ... فقد أدَّى شُكْرَ يَومِهِ، ومَن قال مِثلَ ذلكَ حينَ يُمسي فقد أدَّى شُكْرَ لَيلَتِهِ". (أخرجه أبو داود)',
      categories: [.contentment],
    ),
    DuaModel(
      dua:
          'الحمدُ للهِ الذي أطعمَنا وسقانا ، وكفانا وآوانا ، فكم ممن لا كافيَ له ولا مُؤويَ',
      source: 'السنة النبوية',
      benefit:
          'من أكل طعامًا ثم قال... غُفِرَ له ما تقدَّمَ من ذنبِه وما تأخَّرَ',
      benefitSource:
          'من أكل طعامًا ثم قال : الحمدُ للهِ الذي أطعمَني هذا الطعامَ ورزقنِيهِ من غيرِ حولٍ مني ولا قوةٍ غُفِرَ له ما تقدَّمَ من ذنبِه [ وما تأخَّرَ ] ومن لبِس ثوبًا فقال : الحمدُ للهِ الذي كساني هذا [ الثوبَ ] ورزقنِيهِ من غيرِ حولٍ مني ولا قوةٍ غُفِرَ له ما تقدَّمَ من ذنبِه وما تأخَّرَ. (الراوي معاذ بن أنس، أخرجه الطبراني (20/ 181) (389) بلفظه، والترمذي (3458)، وابن ماجه (3285)، وأحمد (15632) مقتصرا على الفقرة الأولى)',
      categories: [.contentment],
    ),
    DuaModel(
      dua:
          'الحمدُ لله الذي كفَاني وآواني، الحمدُ لله الذي أطعمَني وسقاني، الحمدُ لله الذي منَّ عليَّ وأفضلَ، اللهمَّ إني أسألُك بعزَّتِك أن تُنَجِّيَني من النار',
      source: 'السنة النبوية',
      benefit: 'قد حمِدَ اللهَ بجميعِ محامدِ الخَلْقِ كلِّهمِ',
      benefitSource:
          'من قال إذا أوى إلى فراشِه : الحمدُ لله الذي كفَاني وآواني . الحمدُ لله الذي أطعمَني وسقاني . الحمدُ لله الذي منَّ عليَّ وأفضلَ ، اللهمَّ ! إني أسألُك بعزَّتِك أن تُنَجِّيَني من النارِ ؛ فقد حمِدَ اللهَ بجميعِ محامدِ الخَلْقِ كلِّهمِ. (الراوي أنس بن مالك، أخرجه ابن السني في ((عمل اليوم والليلة)) (720)، والحاكم (2001))',
      categories: [.contentment],
    ),
    DuaModel(
      dua:
          'الحمدُ للَّهِ الَّذي يطعمُ ولا يُطعَمُ ، ومنَّ علينا فَهَدانا وأطعمنا ، وسقانا وَكُلَّ بلاءٍ حسنٍ أبلانا الحمدُ للَّهِ غيرِ مودعٍ ولا مُكافأ ولا مَكْفورٍ ، ولا مُستغنًى عنهُ ، الحمدُ للَّهِ الَّذي أطعمَنا منَ الطَّعامِ ، وسقانا منَ الشَّرابِ ، وَكَسانا منَ العُريِ ، وَهَدانا منَ الضَّلالِ ، وبصَّرَنا منَ العمَى ، وفضَّلَنا علَى كثيرٍ ممَّن خلقَ تفضيلًا ، الحمدُ للَّهِ ربِّ العالمينَ',
      source: 'السنة النبوية',
      benefit: '',
      benefitSource:
          'دعا رجلٌ منَ الأنصارِ ، من أَهْلِ قباءٍ النَّبيَّ صلَّى اللَّهُ عليهِ وسلَّم ، قال فانطلقنا معَهُ ، فلمَّا طعِمَ النَّبيُّ صلَّى اللَّهُ عليهِ وسلَّمَ وغسلَ يدَيهِ ، قالَ "الحمدُ للَّهِ الَّذي يطعمُ ولا يُطعَمُ..". (الراوي أبو هريرة، أخرجه النسائي في ((السنن الكبرى)) (10133)، وابن حبان (5219)، والطبراني في ((الدعاء)) (896))',
      categories: [.contentment],
    ),
    DuaModel(
      dua:
          'رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَصْلِحْ لِي فِي ذُرِّيَّتِي ۖ إِنِّي تُبْتُ إِلَيْكَ وَإِنِّي مِنَ الْمُسْلِمِينَ',
      source: 'سورة الأحقاف: ١٥',
      benefit: '',
      benefitSource:
          'وَوَصَّيْنَا الْإِنسَانَ بِوَالِدَيْهِ إِحْسَانًا ۖ حَمَلَتْهُ أُمُّهُ كُرْهًا وَوَضَعَتْهُ كُرْهًا ۖ وَحَمْلُهُ وَفِصَالُهُ ثَلَاثُونَ شَهْرًا ۚ حَتَّىٰ إِذَا بَلَغَ أَشُدَّهُ وَبَلَغَ أَرْبَعِينَ سَنَةً قَالَ رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَصْلِحْ لِي فِي ذُرِّيَّتِي ۖ إِنِّي تُبْتُ إِلَيْكَ وَإِنِّي مِنَ الْمُسْلِمِينَ (15)',
      categories: [.contentment],
    ),
    DuaModel(
      dua: 'اللهم اجعلني من الطيبين (الطيبات) وارزقني الطيبات (الطيبين)',
      source: '',
      benefit: '',
      categories: [.contentment],
    ),
    DuaModel(
      dua:
          'اللهم امنحني القوة لأقاوم نفسي، والشجاعة لأواجه ضعفي، واليقين لأتقبل قدري، والرضا ليرتاح عقلي، والفهم ليطمئن قلبي',
      source: '',
      benefit: '',
      categories: [.contentment],
    ),
    DuaModel(
      dua: 'اللهم لَا تُعَلِّقْ قَلْبِي الضِّعِيفِ بِمَا لَيسَ لِي',
      source: '',
      benefit: '',
      categories: [.contentment],
    ),

    //? INJUSTICE
    //TODO none exist in the website

    //
    //
    //
    DuaModel(
      dua: '',
      source: 'السنة النبوية',
      benefit: '',
      benefitSource: '',
      categories: [.injustice],
    ),

    //? DEBT
    //TODO none exist in the website

    //
    //
    //
    DuaModel(
      dua: '',
      source: 'السنة النبوية',
      benefit: '',
      benefitSource: '',
      categories: [.debt],
    ),

    //? DISTRESS
    //TODO only suicidal exists, others missing
    DuaModel(
      dua:
          'اللهم أَحْيِنِي ما كانت الحياةُ خيرًا لي ، وتَوَفَّنِي إذا كانت الوفاةُ خيرًا لي',
      source: 'السنة النبوية',
      benefit: '',
      benefitSource:
          'لا يَتَمَنَّيَنَّ أحَدُكُمُ المَوتَ مِن ضُرٍّ أصابَه، فإن كان لا بُدَّ فاعِلًا فليَقُلِ: اللهُمَّ أحيِني ما كانَتِ الحَياةُ خَيرًا لي، وتَوفَّني إذا كانَتِ الوفاةُ خَيرًا لي. (الراوي أنس بن مالك، أخرجه مسلم (2680) واللفظ له، وأخرجه البخاري (6351) باختلاف يسير)',
      categories: [.distress],
    ),

    //
    //
    //
    DuaModel(
      dua: '',
      source: 'السنة النبوية',
      benefit: '',
      benefitSource: '',
      categories: [.distress],
    ),

    //? HEALING
    //TODO none exist in the website

    //
    //
    //
    DuaModel(
      dua: '',
      source: 'السنة النبوية',
      benefit: '',
      benefitSource: '',
      categories: [.healing],
    ),
  ];

  static List<DuaModel> get allSupplications => _allMoodSupplications;

  static List<DuaModel> getSupplicationByCategory(DuaCategories category) {
    return _allMoodSupplications.where((item) {
      // Check if categories is not null, then check if it contains the specific category
      return item.categories != null && item.categories!.contains(category);
    }).toList();
  }
}
