import 'package:project_azkar/data/models/dua_model.dart';
import 'package:project_azkar/data/repos/after_salah_repo.dart';
import 'package:project_azkar/data/repos/day_night_zekr_repo.dart';

import '../../utils/enums.dart';

abstract class ZekrRepo {
  static final List<DuaModel> _allAzkar = [
    ...DayNightZekrRepo.azkar,
    ...AfterSalahRepo.azkar,
    //? Before sleep
    DuaModel(
      dua:
          "اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ",
      time: [DuaTime.beforeSleep],
      source: "آية الكرسى - البقرة: ٢٥٥",
      benefit:
          'من قرأها إذا أوى إلى فراشه فإنه لن يزال عليه من اللَّه حافظ ولا يقربه شيطان حتى يصبح',
      benefitSource:
          'في حديث أبي هريرة رضي الله عنه مع الشيطان: "...قال لي: إذا أوَيْتَ إلى فِراشِكَ فاقْرَأْ آيَةَ الكُرْسِيِّ... لن يَزالَ مَعكَ مِنَ اللَّهِ حافِظٌ، ولا يَقْرَبُكَ شيطانٌ حتَّى تُصْبِحَ. فقال النبي ﷺ: صَدَقَكَ وهو كَذُوبٌ". (أخرجه البخاري)',
    ),
    DuaModel(
      dua:
          'آمَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ كُلٌّ آمَنَ بِاللَّهِ وَمَلآئِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لاَ نُفَرِّقُ بَيْنَ أَحَدٍ مِّن رُّسُلِهِ وَقَالُواْ سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ* لاَ يُكَلِّفُ اللَّهُ نَفْساً إِلاَّ وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لاَ تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلاَ تَحْمِلْ عَلَيْنَا إِصْراً كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا رَبَّنَا وَلاَ تُحَمِّلْنَا مَا لاَ طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَآ أَنتَ مَوْلاَنَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ',
      time: [DuaTime.beforeSleep],
      source: 'سورة البقرة: ٢٨٥-٢٨٦',
      benefit: 'من قرأهما في ليلة كفتاه',
      benefitSource:
          'عن أبي مسعود الأنصاري رضي الله عنه قال: قال النبي ﷺ: "مَن قَرَأَ بالآيَتَيْنِ مِنْ آخِرِ سُورَةِ البَقَرَةِ في لَيْلَةٍ كَفَتاهُ". (أخرجه البخاري ومسلم)',
    ),

    DuaModel(
      dua:
          'اللَّهُمَّ أَسْلَمْتُ نَفْسِي إِلَيْكَ، وَوَجَّهْتُ وَجْهِي إِلَيْكَ، وَفَوَّضْتُ أَمْرِي إِلَيْكَ، وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ، رَغْبَةً وَرَهْبَةً إِلَيْكَ، لَا مَلْجَأَ وَلَا مَنْجَا مِنْكَ إِلَّا إِلَيْكَ، آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ، وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ',
      time: [DuaTime.beforeSleep],
      source: 'السنة النبوية',
      benefit:
          'ضمان عظيم من السنة النبوية؛ فمن قاله ثم قُبضت روحه في تلك الليلة، مات على الفطرة السليمة (دين الإسلام)',
      benefitSource:
          'قال - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - لمن قال ذلك: ((فإن مُتَّ مُتَّ على الفطرة)). أخرجه البخاري ومسلم',
    ),
  ];

  static List<DuaModel> get allAzkar => _allAzkar;

  // Get Azkar by Time (Morning/Night/AfterSalah)
  static List<DuaModel> getAzkarByTime(DuaTime time) {
    return _allAzkar.where((item) {
      return item.time?.contains(time) ?? false;
    }).toList();
  }

  // Search functionality
  static List<DuaModel> searchAzkar(String query) {
    return _allAzkar.where((item) {
      return item.dua.contains(query) || (item.source.contains(query));
    }).toList();
  }
}
